gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
/***************************************************************************//**
* \file UART1.h
* \version 4.0
*
* \brief
*  This file provides constants and parameter values for the SCB Component.
*
* Note:
*
********************************************************************************
* \copyright
* Copyright 2013-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_SCB_UART1_H)
#define CY_SCB_UART1_H

#include <cydevice_trm.h>
#include <cyfitter.h>
#include <cytypes.h>
#include <CyLib.h>

/* SCB IP block v0 is available in PSoC 4100/PSoC 4200 */
#define UART1_CY_SCBIP_V0    (CYIPBLOCK_m0s8scb_VERSION == 0u)
/* SCB IP block v1 is available in PSoC 4000 */
#define UART1_CY_SCBIP_V1    (CYIPBLOCK_m0s8scb_VERSION == 1u)
/* SCB IP block v2 is available in all other devices */
#define UART1_CY_SCBIP_V2    (CYIPBLOCK_m0s8scb_VERSION >= 2u)

/** Component version major.minor */
#define UART1_COMP_VERSION_MAJOR    (4)
#define UART1_COMP_VERSION_MINOR    (0)
    
#define UART1_SCB_MODE           (4u)

/* SCB modes enum */
#define UART1_SCB_MODE_I2C       (0x01u)
#define UART1_SCB_MODE_SPI       (0x02u)
#define UART1_SCB_MODE_UART      (0x04u)
#define UART1_SCB_MODE_EZI2C     (0x08u)
#define UART1_SCB_MODE_UNCONFIG  (0xFFu)

/* Condition compilation depends on operation mode: Unconfigured implies apply to all modes */
#define UART1_SCB_MODE_I2C_CONST_CFG       (UART1_SCB_MODE_I2C       == UART1_SCB_MODE)
#define UART1_SCB_MODE_SPI_CONST_CFG       (UART1_SCB_MODE_SPI       == UART1_SCB_MODE)
#define UART1_SCB_MODE_UART_CONST_CFG      (UART1_SCB_MODE_UART      == UART1_SCB_MODE)
#define UART1_SCB_MODE_EZI2C_CONST_CFG     (UART1_SCB_MODE_EZI2C     == UART1_SCB_MODE)
#define UART1_SCB_MODE_UNCONFIG_CONST_CFG  (UART1_SCB_MODE_UNCONFIG  == UART1_SCB_MODE)

/* Condition compilation for includes */
#define UART1_SCB_MODE_I2C_INC      (0u !=(UART1_SCB_MODE_I2C   & UART1_SCB_MODE))
#define UART1_SCB_MODE_EZI2C_INC    (0u !=(UART1_SCB_MODE_EZI2C & UART1_SCB_MODE))
#if (!UART1_CY_SCBIP_V1)
    #define UART1_SCB_MODE_SPI_INC  (0u !=(UART1_SCB_MODE_SPI   & UART1_SCB_MODE))
    #define UART1_SCB_MODE_UART_INC (0u !=(UART1_SCB_MODE_UART  & UART1_SCB_MODE))
#else
    #define UART1_SCB_MODE_SPI_INC  (0u)
    #define UART1_SCB_MODE_UART_INC (0u)
#endif /* (!UART1_CY_SCBIP_V1) */

/* Interrupts remove options */
#define UART1_REMOVE_SCB_IRQ             (1u)
#define UART1_SCB_IRQ_INTERNAL           (0u == UART1_REMOVE_SCB_IRQ)

#define UART1_REMOVE_UART_RX_WAKEUP_IRQ  (1u)
#define UART1_UART_RX_WAKEUP_IRQ         (0u == UART1_REMOVE_UART_RX_WAKEUP_IRQ)

/* SCB interrupt enum */
#define UART1_SCB_INTR_MODE_NONE     (0u)
#define UART1_SCB_INTR_MODE_INTERNAL (1u)
#define UART1_SCB_INTR_MODE_EXTERNAL (2u)

/* Internal clock remove option */
#define UART1_REMOVE_SCB_CLK     (1u)
#define UART1_SCB_CLK_INTERNAL   (0u == UART1_REMOVE_SCB_CLK)


/***************************************
*       Includes
****************************************/

#include "UART1_PINS.h"

#if (UART1_SCB_CLK_INTERNAL)
    #include "UART1_SCBCLK.h"
#endif /* (UART1_SCB_CLK_INTERNAL) */


/***************************************
*       Type Definitions
***************************************/

typedef struct
{
    uint8 enableState;
} UART1_BACKUP_STRUCT;


/***************************************
*        Function Prototypes
***************************************/

/**
* \addtogroup group_general
* @{
*/

/* Start and Stop APIs */
void UART1_Init(void);
void UART1_Enable(void);
void UART1_Start(void);
void UART1_Stop(void);

/** @} general */

/**
* \addtogroup group_power
* @{
*/
/* Sleep and Wakeup APis */
void UART1_Sleep(void);
void UART1_Wakeup(void);
/** @} power */ 

/**
* \addtogroup group_interrupt
* @{
*/
#if (UART1_SCB_IRQ_INTERNAL)
    /* Custom interrupt handler */
    void UART1_SetCustomInterruptHandler(void (*func)(void));
#endif /* (UART1_SCB_IRQ_INTERNAL) */
/** @} interrupt */

/* Interface to internal interrupt component */
#if (UART1_SCB_IRQ_INTERNAL)
    /**
    * \addtogroup group_interrupt
    * @{
    */    
    /*******************************************************************************
    * Function Name: UART1_EnableInt
    ****************************************************************************//**
    *
    *  When using an Internal interrupt, this enables the interrupt in the NVIC. 
    *  When using an external interrupt the API for the interrupt component must 
    *  be used to enable the interrupt.
    *
    *******************************************************************************/
    #define UART1_EnableInt()    CyIntEnable(UART1_ISR_NUMBER)
    
    
    /*******************************************************************************
    * Function Name: UART1_DisableInt
    ****************************************************************************//**
    *
    *  When using an Internal interrupt, this disables the interrupt in the NVIC. 
    *  When using an external interrupt the API for the interrupt component must 
    *  be used to disable the interrupt.
    *
    *******************************************************************************/    
    #define UART1_DisableInt()   CyIntDisable(UART1_ISR_NUMBER)
    /** @} interrupt */

    /*******************************************************************************
    * Function Name: UART1_ClearPendingInt
    ****************************************************************************//**
    *
    *  This function clears the interrupt pending status in the NVIC. 
    *
    *******************************************************************************/
    #define UART1_ClearPendingInt()  CyIntClearPending(UART1_ISR_NUMBER)
#endif /* (UART1_SCB_IRQ_INTERNAL) */

