gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
#if (UART1_UART_RX_WAKEUP_IRQ)
    /*******************************************************************************
    * Function Name: UART1_RxWakeEnableInt
    ****************************************************************************//**
    *
    *  This function enables the interrupt (RX_WAKE) pending status in the NVIC. 
    *
    *******************************************************************************/    
    #define UART1_RxWakeEnableInt()  CyIntEnable(UART1_RX_WAKE_ISR_NUMBER)
    

    /*******************************************************************************
    * Function Name: UART1_RxWakeDisableInt
    ****************************************************************************//**
    *
    *  This function disables the interrupt (RX_WAKE) pending status in the NVIC.  
    *
    *******************************************************************************/
    #define UART1_RxWakeDisableInt() CyIntDisable(UART1_RX_WAKE_ISR_NUMBER)
    
    
    /*******************************************************************************
    * Function Name: UART1_RxWakeClearPendingInt
    ****************************************************************************//**
    *
    *  This function clears the interrupt (RX_WAKE) pending status in the NVIC. 
    *
    *******************************************************************************/    
    #define UART1_RxWakeClearPendingInt()  CyIntClearPending(UART1_RX_WAKE_ISR_NUMBER)
#endif /* (UART1_UART_RX_WAKEUP_IRQ) */

/**
* \addtogroup group_interrupt
* @{
*/
/* Get interrupt cause */
/*******************************************************************************
* Function Name: UART1_GetInterruptCause
****************************************************************************//**
*
*  Returns a mask of bits showing the source of the current triggered interrupt. 
*  This is useful for modes of operation where an interrupt can be generated by 
*  conditions in multiple interrupt source registers.
*
*  \return
*   Mask with the OR of the following conditions that have been triggered.
*    - UART1_INTR_CAUSE_MASTER - Interrupt from Master
*    - UART1_INTR_CAUSE_SLAVE - Interrupt from Slave
*    - UART1_INTR_CAUSE_TX - Interrupt from TX
*    - UART1_INTR_CAUSE_RX - Interrupt from RX
*
*******************************************************************************/
#define UART1_GetInterruptCause()    (UART1_INTR_CAUSE_REG)


/* APIs to service INTR_RX register */
/*******************************************************************************
* Function Name: UART1_GetRxInterruptSource
****************************************************************************//**
*
*  Returns RX interrupt request register. This register contains current status 
*  of RX interrupt sources.
*
*  \return
*   Current status of RX interrupt sources.
*   Each constant is a bit field value. The value returned may have multiple 
*   bits set to indicate the current status.
*   - UART1_INTR_RX_FIFO_LEVEL - The number of data elements in the 
      RX FIFO is greater than the value of RX FIFO level.
*   - UART1_INTR_RX_NOT_EMPTY - Receiver FIFO is not empty.
*   - UART1_INTR_RX_FULL - Receiver FIFO is full.
*   - UART1_INTR_RX_OVERFLOW - Attempt to write to a full 
*     receiver FIFO.
*   - UART1_INTR_RX_UNDERFLOW - Attempt to read from an empty 
*     receiver FIFO.
*   - UART1_INTR_RX_FRAME_ERROR - UART framing error detected.
*   - UART1_INTR_RX_PARITY_ERROR - UART parity error detected.
*
*******************************************************************************/
#define UART1_GetRxInterruptSource() (UART1_INTR_RX_REG)


/*******************************************************************************
* Function Name: UART1_SetRxInterruptMode
****************************************************************************//**
*
*  Writes RX interrupt mask register. This register configures which bits from 
*  RX interrupt request register will trigger an interrupt event.
*
*  \param interruptMask: RX interrupt sources to be enabled (refer to 
*   UART1_GetRxInterruptSource() function for bit fields values).
*
*******************************************************************************/
#define UART1_SetRxInterruptMode(interruptMask)     UART1_WRITE_INTR_RX_MASK(interruptMask)


/*******************************************************************************
* Function Name: UART1_GetRxInterruptMode
****************************************************************************//**
*
*  Returns RX interrupt mask register This register specifies which bits from 
*  RX interrupt request register will trigger an interrupt event.
*
*  \return 
*   RX interrupt sources to be enabled (refer to 
*   UART1_GetRxInterruptSource() function for bit fields values).
*
*******************************************************************************/
#define UART1_GetRxInterruptMode()   (UART1_INTR_RX_MASK_REG)


/*******************************************************************************
* Function Name: UART1_GetRxInterruptSourceMasked
****************************************************************************//**
*
*  Returns RX interrupt masked request register. This register contains logical
*  AND of corresponding bits from RX interrupt request and mask registers.
*  This function is intended to be used in the interrupt service routine to 
*  identify which of enabled RX interrupt sources cause interrupt event.
*
*  \return 
*   Current status of enabled RX interrupt sources (refer to 
*   UART1_GetRxInterruptSource() function for bit fields values).
*
*******************************************************************************/
#define UART1_GetRxInterruptSourceMasked()   (UART1_INTR_RX_MASKED_REG)


/*******************************************************************************
* Function Name: UART1_ClearRxInterruptSource
****************************************************************************//**
*
*  Clears RX interrupt sources in the interrupt request register.
*
*  \param interruptMask: RX interrupt sources to be cleared (refer to 
*   UART1_GetRxInterruptSource() function for bit fields values).
*
*  \sideeffects 
*   The side effects are listed in the table below for each 
*   affected interrupt source. Refer to section RX FIFO interrupt sources for 
*   detailed description.
*   - UART1_INTR_RX_FIFO_LEVEL Interrupt source is not cleared when 
*     the receiver FIFO has more entries than level.
*   - UART1_INTR_RX_NOT_EMPTY Interrupt source is not cleared when
*     receiver FIFO is not empty.
*   - UART1_INTR_RX_FULL Interrupt source is not cleared when 
*      receiver FIFO is full.
*
*******************************************************************************/
#define UART1_ClearRxInterruptSource(interruptMask)  UART1_CLEAR_INTR_RX(interruptMask)


