gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
/*******************************************************************************
* Function Name: UART1_SetRxInterrupt
****************************************************************************//**
*
*  Sets RX interrupt sources in the interrupt request register.
*
*  \param interruptMask: RX interrupt sources to set in the RX interrupt request 
*   register (refer to UART1_GetRxInterruptSource() function for bit 
*   fields values).
*
*******************************************************************************/
#define UART1_SetRxInterrupt(interruptMask)  UART1_SET_INTR_RX(interruptMask)

void UART1_SetRxFifoLevel(uint32 level);


/* APIs to service INTR_TX register */
/*******************************************************************************
* Function Name: UART1_GetTxInterruptSource
****************************************************************************//**
*
*  Returns TX interrupt request register. This register contains current status 
*  of TX interrupt sources.
* 
*  \return 
*   Current status of TX interrupt sources.
*   Each constant is a bit field value. The value returned may have multiple 
*   bits set to indicate the current status.
*   - UART1_INTR_TX_FIFO_LEVEL - The number of data elements in the 
*     TX FIFO is less than the value of TX FIFO level.
*   - UART1_INTR_TX_NOT_FULL - Transmitter FIFO is not full.
*   - UART1_INTR_TX_EMPTY - Transmitter FIFO is empty.
*   - UART1_INTR_TX_OVERFLOW - Attempt to write to a full 
*     transmitter FIFO.
*   - UART1_INTR_TX_UNDERFLOW - Attempt to read from an empty 
*     transmitter FIFO.
*   - UART1_INTR_TX_UART_NACK - UART received a NACK in SmartCard 
*   mode.
*   - UART1_INTR_TX_UART_DONE - UART transfer is complete. 
*     All data elements from the TX FIFO are sent.
*   - UART1_INTR_TX_UART_ARB_LOST - Value on the TX line of the UART
*     does not match the value on the RX line.
*
*******************************************************************************/
#define UART1_GetTxInterruptSource() (UART1_INTR_TX_REG)


/*******************************************************************************
* Function Name: UART1_SetTxInterruptMode
****************************************************************************//**
*
*  Writes TX interrupt mask register. This register configures which bits from 
*  TX interrupt request register will trigger an interrupt event.
*
*  \param interruptMask: TX interrupt sources to be enabled (refer to 
*   UART1_GetTxInterruptSource() function for bit field values).
*
*******************************************************************************/
#define UART1_SetTxInterruptMode(interruptMask)  UART1_WRITE_INTR_TX_MASK(interruptMask)


/*******************************************************************************
* Function Name: UART1_GetTxInterruptMode
****************************************************************************//**
*
*  Returns TX interrupt mask register This register specifies which bits from 
*  TX interrupt request register will trigger an interrupt event.
*
*  \return 
*   Enabled TX interrupt sources (refer to 
*   UART1_GetTxInterruptSource() function for bit field values).
*   
*******************************************************************************/
#define UART1_GetTxInterruptMode()   (UART1_INTR_TX_MASK_REG)


/*******************************************************************************
* Function Name: UART1_GetTxInterruptSourceMasked
****************************************************************************//**
*
*  Returns TX interrupt masked request register. This register contains logical
*  AND of corresponding bits from TX interrupt request and mask registers.
*  This function is intended to be used in the interrupt service routine to identify 
*  which of enabled TX interrupt sources cause interrupt event.
*
*  \return 
*   Current status of enabled TX interrupt sources (refer to 
*   UART1_GetTxInterruptSource() function for bit field values).
*
*******************************************************************************/
#define UART1_GetTxInterruptSourceMasked()   (UART1_INTR_TX_MASKED_REG)


/*******************************************************************************
* Function Name: UART1_ClearTxInterruptSource
****************************************************************************//**
*
*  Clears TX interrupt sources in the interrupt request register.
*
*  \param interruptMask: TX interrupt sources to be cleared (refer to 
*   UART1_GetTxInterruptSource() function for bit field values).
*
*  \sideeffects 
*   The side effects are listed in the table below for each affected interrupt 
*   source. Refer to section TX FIFO interrupt sources for detailed description.
*   - UART1_INTR_TX_FIFO_LEVEL - Interrupt source is not cleared when 
*     transmitter FIFO has less entries than level.
*   - UART1_INTR_TX_NOT_FULL - Interrupt source is not cleared when
*     transmitter FIFO has empty entries.
*   - UART1_INTR_TX_EMPTY - Interrupt source is not cleared when 
*     transmitter FIFO is empty.
*   - UART1_INTR_TX_UNDERFLOW - Interrupt source is not cleared when 
*     transmitter FIFO is empty and I2C mode with clock stretching is selected. 
*     Put data into the transmitter FIFO before clearing it. This behavior only 
*     applicable for PSoC 4100/PSoC 4200 devices.
*
*******************************************************************************/
#define UART1_ClearTxInterruptSource(interruptMask)  UART1_CLEAR_INTR_TX(interruptMask)


/*******************************************************************************
* Function Name: UART1_SetTxInterrupt
****************************************************************************//**
*
*  Sets RX interrupt sources in the interrupt request register.
*
*  \param interruptMask: RX interrupt sources to set in the RX interrupt request 
*   register (refer to UART1_GetRxInterruptSource() function for bit 
*   fields values).
*
*******************************************************************************/
#define UART1_SetTxInterrupt(interruptMask)  UART1_SET_INTR_TX(interruptMask)

void UART1_SetTxFifoLevel(uint32 level);


