gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
/* APIs to service INTR_MASTER register */
/*******************************************************************************
* Function Name: UART1_GetMasterInterruptSource
****************************************************************************//**
*
*  Returns Master interrupt request register. This register contains current 
*  status of Master interrupt sources.
*
*  \return 
*   Current status of Master interrupt sources. 
*   Each constant is a bit field value. The value returned may have multiple 
*   bits set to indicate the current status.
*   - UART1_INTR_MASTER_SPI_DONE - SPI master transfer is complete.
*     Refer to Interrupt sources section for detailed description.
*   - UART1_INTR_MASTER_I2C_ARB_LOST - I2C master lost arbitration.
*   - UART1_INTR_MASTER_I2C_NACK - I2C master received negative 
*    acknowledgement (NAK).
*   - UART1_INTR_MASTER_I2C_ACK - I2C master received acknowledgement.
*   - UART1_INTR_MASTER_I2C_STOP - I2C master generated STOP.
*   - UART1_INTR_MASTER_I2C_BUS_ERROR - I2C master bus error 
*     (detection of unexpected START or STOP condition).
*
*******************************************************************************/
#define UART1_GetMasterInterruptSource() (UART1_INTR_MASTER_REG)

/*******************************************************************************
* Function Name: UART1_SetMasterInterruptMode
****************************************************************************//**
*
*  Writes Master interrupt mask register. This register configures which bits 
*  from Master interrupt request register will trigger an interrupt event.
*
*  \param interruptMask: Master interrupt sources to be enabled (refer to 
*   UART1_GetMasterInterruptSource() function for bit field values).
*
*******************************************************************************/
#define UART1_SetMasterInterruptMode(interruptMask)  UART1_WRITE_INTR_MASTER_MASK(interruptMask)

/*******************************************************************************
* Function Name: UART1_GetMasterInterruptMode
****************************************************************************//**
*
*  Returns Master interrupt mask register This register specifies which bits 
*  from Master interrupt request register will trigger an interrupt event.
*
*  \return 
*   Enabled Master interrupt sources (refer to 
*   UART1_GetMasterInterruptSource() function for return values).
*
*******************************************************************************/
#define UART1_GetMasterInterruptMode()   (UART1_INTR_MASTER_MASK_REG)

/*******************************************************************************
* Function Name: UART1_GetMasterInterruptSourceMasked
****************************************************************************//**
*
*  Returns Master interrupt masked request register. This register contains 
*  logical AND of corresponding bits from Master interrupt request and mask 
*  registers.
*  This function is intended to be used in the interrupt service routine to 
*  identify which of enabled Master interrupt sources cause interrupt event.
*
*  \return 
*   Current status of enabled Master interrupt sources (refer to 
*   UART1_GetMasterInterruptSource() function for return values).
*
*******************************************************************************/
#define UART1_GetMasterInterruptSourceMasked()   (UART1_INTR_MASTER_MASKED_REG)

/*******************************************************************************
* Function Name: UART1_ClearMasterInterruptSource
****************************************************************************//**
*
*  Clears Master interrupt sources in the interrupt request register.
*
*  \param interruptMask: Master interrupt sources to be cleared (refer to 
*   UART1_GetMasterInterruptSource() function for bit field values).
*
*******************************************************************************/
#define UART1_ClearMasterInterruptSource(interruptMask)  UART1_CLEAR_INTR_MASTER(interruptMask)

/*******************************************************************************
* Function Name: UART1_SetMasterInterrupt
****************************************************************************//**
*
*  Sets Master interrupt sources in the interrupt request register.
*
*  \param interruptMask: Master interrupt sources to set in the Master interrupt
*   request register (refer to UART1_GetMasterInterruptSource() 
*   function for bit field values).
*
*******************************************************************************/
#define UART1_SetMasterInterrupt(interruptMask)  UART1_SET_INTR_MASTER(interruptMask)


/* APIs to service INTR_SLAVE register */
/*******************************************************************************
* Function Name: UART1_GetSlaveInterruptSource
****************************************************************************//**
*
*  Returns Slave interrupt request register. This register contains current 
*  status of Slave interrupt sources.
*
*  \return 
*   Current status of Slave interrupt sources.
*   Each constant is a bit field value. The value returned may have multiple 
*   bits set to indicate the current status.
*   - UART1_INTR_SLAVE_I2C_ARB_LOST - I2C slave lost arbitration: 
*     the value driven on the SDA line is not the same as the value observed 
*     on the SDA line.
*   - UART1_INTR_SLAVE_I2C_NACK - I2C slave received negative 
*     acknowledgement (NAK).
*   - UART1_INTR_SLAVE_I2C_ACK - I2C slave received 
*     acknowledgement (ACK).
*   - UART1_INTR_SLAVE_I2C_WRITE_STOP - Stop or Repeated Start 
*     event for write transfer intended for this slave (address matching 
*     is performed).
*   - UART1_INTR_SLAVE_I2C_STOP - Stop or Repeated Start event 
*     for (read or write) transfer intended for this slave (address matching 
*     is performed).
*   - UART1_INTR_SLAVE_I2C_START - I2C slave received Start 
*     condition.
*   - UART1_INTR_SLAVE_I2C_ADDR_MATCH - I2C slave received matching 
*     address.
*   - UART1_INTR_SLAVE_I2C_GENERAL - I2C Slave received general 
*     call address.
*   - UART1_INTR_SLAVE_I2C_BUS_ERROR - I2C slave bus error (detection 
*      of unexpected Start or Stop condition).
*   - UART1_INTR_SLAVE_SPI_BUS_ERROR - SPI slave select line is 
*      deselected at an expected time while the SPI transfer.
*
*******************************************************************************/
#define UART1_GetSlaveInterruptSource()  (UART1_INTR_SLAVE_REG)

