gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
/*******************************************************************************
* Function Name: UART1_SetSlaveInterruptMode
****************************************************************************//**
*
*  Writes Slave interrupt mask register. 
*  This register configures which bits from Slave interrupt request register 
*  will trigger an interrupt event.
*
*  \param interruptMask: Slave interrupt sources to be enabled (refer to 
*   UART1_GetSlaveInterruptSource() function for bit field values).
*
*******************************************************************************/
#define UART1_SetSlaveInterruptMode(interruptMask)   UART1_WRITE_INTR_SLAVE_MASK(interruptMask)

/*******************************************************************************
* Function Name: UART1_GetSlaveInterruptMode
****************************************************************************//**
*
*  Returns Slave interrupt mask register.
*  This register specifies which bits from Slave interrupt request register 
*  will trigger an interrupt event.
*
*  \return 
*   Enabled Slave interrupt sources(refer to 
*   UART1_GetSlaveInterruptSource() function for bit field values).
*
*******************************************************************************/
#define UART1_GetSlaveInterruptMode()    (UART1_INTR_SLAVE_MASK_REG)

/*******************************************************************************
* Function Name: UART1_GetSlaveInterruptSourceMasked
****************************************************************************//**
*
*  Returns Slave interrupt masked request register. This register contains 
*  logical AND of corresponding bits from Slave interrupt request and mask 
*  registers.
*  This function is intended to be used in the interrupt service routine to 
*  identify which of enabled Slave interrupt sources cause interrupt event.
*
*  \return 
*   Current status of enabled Slave interrupt sources (refer to 
*   UART1_GetSlaveInterruptSource() function for return values).
*
*******************************************************************************/
#define UART1_GetSlaveInterruptSourceMasked()    (UART1_INTR_SLAVE_MASKED_REG)

/*******************************************************************************
* Function Name: UART1_ClearSlaveInterruptSource
****************************************************************************//**
*
*  Clears Slave interrupt sources in the interrupt request register.
*
*  \param interruptMask: Slave interrupt sources to be cleared (refer to 
*   UART1_GetSlaveInterruptSource() function for return values).
*
*******************************************************************************/
#define UART1_ClearSlaveInterruptSource(interruptMask)   UART1_CLEAR_INTR_SLAVE(interruptMask)

/*******************************************************************************
* Function Name: UART1_SetSlaveInterrupt
****************************************************************************//**
*
*  Sets Slave interrupt sources in the interrupt request register.
*
*  \param interruptMask: Slave interrupt sources to set in the Slave interrupt 
*   request register (refer to UART1_GetSlaveInterruptSource() 
*   function for return values).
*
*******************************************************************************/
#define UART1_SetSlaveInterrupt(interruptMask)   UART1_SET_INTR_SLAVE(interruptMask)

/** @} interrupt */ 


/***************************************
*     Vars with External Linkage
***************************************/

/**
* \addtogroup group_globals
* @{
*/

/** UART1_initVar indicates whether the UART1 
*  component has been initialized. The variable is initialized to 0 
*  and set to 1 the first time SCB_Start() is called. This allows 
*  the component to restart without reinitialization after the first 
*  call to the UART1_Start() routine.
*
*  If re-initialization of the component is required, then the 
*  UART1_Init() function can be called before the 
*  UART1_Start() or UART1_Enable() function.
*/
extern uint8 UART1_initVar;
/** @} globals */

/***************************************
*              Registers
***************************************/

#define UART1_CTRL_REG               (*(reg32 *) UART1_SCB__CTRL)
#define UART1_CTRL_PTR               ( (reg32 *) UART1_SCB__CTRL)

#define UART1_STATUS_REG             (*(reg32 *) UART1_SCB__STATUS)
#define UART1_STATUS_PTR             ( (reg32 *) UART1_SCB__STATUS)

#if (!UART1_CY_SCBIP_V1)
    #define UART1_SPI_CTRL_REG           (*(reg32 *) UART1_SCB__SPI_CTRL)
    #define UART1_SPI_CTRL_PTR           ( (reg32 *) UART1_SCB__SPI_CTRL)

    #define UART1_SPI_STATUS_REG         (*(reg32 *) UART1_SCB__SPI_STATUS)
    #define UART1_SPI_STATUS_PTR         ( (reg32 *) UART1_SCB__SPI_STATUS)

    #define UART1_UART_CTRL_REG          (*(reg32 *) UART1_SCB__UART_CTRL)
    #define UART1_UART_CTRL_PTR          ( (reg32 *) UART1_SCB__UART_CTRL)

    #define UART1_UART_TX_CTRL_REG       (*(reg32 *) UART1_SCB__UART_TX_CTRL)
    #define UART1_UART_TX_CTRL_PTR       ( (reg32 *) UART1_SCB__UART_TX_CTRL)

    #define UART1_UART_RX_CTRL_REG       (*(reg32 *) UART1_SCB__UART_RX_CTRL)
    #define UART1_UART_RX_CTRL_PTR       ( (reg32 *) UART1_SCB__UART_RX_CTRL)

    #define UART1_UART_RX_STATUS_REG     (*(reg32 *) UART1_SCB__UART_RX_STATUS)
    #define UART1_UART_RX_STATUS_PTR     ( (reg32 *) UART1_SCB__UART_RX_STATUS)
#endif /* (!UART1_CY_SCBIP_V1) */

#if !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
    #define UART1_UART_FLOW_CTRL_REG     (*(reg32 *) UART1_SCB__UART_FLOW_CTRL)
    #define UART1_UART_FLOW_CTRL_PTR     ( (reg32 *) UART1_SCB__UART_FLOW_CTRL)
#endif /* !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */

#define UART1_I2C_CTRL_REG           (*(reg32 *) UART1_SCB__I2C_CTRL)
#define UART1_I2C_CTRL_PTR           ( (reg32 *) UART1_SCB__I2C_CTRL)

#define UART1_I2C_STATUS_REG         (*(reg32 *) UART1_SCB__I2C_STATUS)
#define UART1_I2C_STATUS_PTR         ( (reg32 *) UART1_SCB__I2C_STATUS)

#define UART1_I2C_MASTER_CMD_REG     (*(reg32 *) UART1_SCB__I2C_M_CMD)
#define UART1_I2C_MASTER_CMD_PTR     ( (reg32 *) UART1_SCB__I2C_M_CMD)

#define UART1_I2C_SLAVE_CMD_REG      (*(reg32 *) UART1_SCB__I2C_S_CMD)
#define UART1_I2C_SLAVE_CMD_PTR      ( (reg32 *) UART1_SCB__I2C_S_CMD)

#define UART1_I2C_CFG_REG            (*(reg32 *) UART1_SCB__I2C_CFG)
#define UART1_I2C_CFG_PTR            ( (reg32 *) UART1_SCB__I2C_CFG)

#define UART1_TX_CTRL_REG            (*(reg32 *) UART1_SCB__TX_CTRL)
#define UART1_TX_CTRL_PTR            ( (reg32 *) UART1_SCB__TX_CTRL)

#define UART1_TX_FIFO_CTRL_REG       (*(reg32 *) UART1_SCB__TX_FIFO_CTRL)
#define UART1_TX_FIFO_CTRL_PTR       ( (reg32 *) UART1_SCB__TX_FIFO_CTRL)

