gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
#define UART1_TX_FIFO_STATUS_REG     (*(reg32 *) UART1_SCB__TX_FIFO_STATUS)
#define UART1_TX_FIFO_STATUS_PTR     ( (reg32 *) UART1_SCB__TX_FIFO_STATUS)

#define UART1_TX_FIFO_WR_REG         (*(reg32 *) UART1_SCB__TX_FIFO_WR)
#define UART1_TX_FIFO_WR_PTR         ( (reg32 *) UART1_SCB__TX_FIFO_WR)

#define UART1_RX_CTRL_REG            (*(reg32 *) UART1_SCB__RX_CTRL)
#define UART1_RX_CTRL_PTR            ( (reg32 *) UART1_SCB__RX_CTRL)

#define UART1_RX_FIFO_CTRL_REG       (*(reg32 *) UART1_SCB__RX_FIFO_CTRL)
#define UART1_RX_FIFO_CTRL_PTR       ( (reg32 *) UART1_SCB__RX_FIFO_CTRL)

#define UART1_RX_FIFO_STATUS_REG     (*(reg32 *) UART1_SCB__RX_FIFO_STATUS)
#define UART1_RX_FIFO_STATUS_PTR     ( (reg32 *) UART1_SCB__RX_FIFO_STATUS)

#define UART1_RX_MATCH_REG           (*(reg32 *) UART1_SCB__RX_MATCH)
#define UART1_RX_MATCH_PTR           ( (reg32 *) UART1_SCB__RX_MATCH)

#define UART1_RX_FIFO_RD_REG         (*(reg32 *) UART1_SCB__RX_FIFO_RD)
#define UART1_RX_FIFO_RD_PTR         ( (reg32 *) UART1_SCB__RX_FIFO_RD)

#define UART1_RX_FIFO_RD_SILENT_REG  (*(reg32 *) UART1_SCB__RX_FIFO_RD_SILENT)
#define UART1_RX_FIFO_RD_SILENT_PTR  ( (reg32 *) UART1_SCB__RX_FIFO_RD_SILENT)

#ifdef UART1_SCB__EZ_DATA0
    #define UART1_EZBUF_DATA0_REG    (*(reg32 *) UART1_SCB__EZ_DATA0)
    #define UART1_EZBUF_DATA0_PTR    ( (reg32 *) UART1_SCB__EZ_DATA0)
#else
    #define UART1_EZBUF_DATA0_REG    (*(reg32 *) UART1_SCB__EZ_DATA00)
    #define UART1_EZBUF_DATA0_PTR    ( (reg32 *) UART1_SCB__EZ_DATA00)
#endif /* UART1_SCB__EZ_DATA00 */

#define UART1_INTR_CAUSE_REG         (*(reg32 *) UART1_SCB__INTR_CAUSE)
#define UART1_INTR_CAUSE_PTR         ( (reg32 *) UART1_SCB__INTR_CAUSE)

#define UART1_INTR_I2C_EC_REG        (*(reg32 *) UART1_SCB__INTR_I2C_EC)
#define UART1_INTR_I2C_EC_PTR        ( (reg32 *) UART1_SCB__INTR_I2C_EC)

#define UART1_INTR_I2C_EC_MASK_REG   (*(reg32 *) UART1_SCB__INTR_I2C_EC_MASK)
#define UART1_INTR_I2C_EC_MASK_PTR   ( (reg32 *) UART1_SCB__INTR_I2C_EC_MASK)

#define UART1_INTR_I2C_EC_MASKED_REG (*(reg32 *) UART1_SCB__INTR_I2C_EC_MASKED)
#define UART1_INTR_I2C_EC_MASKED_PTR ( (reg32 *) UART1_SCB__INTR_I2C_EC_MASKED)

#if (!UART1_CY_SCBIP_V1)
    #define UART1_INTR_SPI_EC_REG        (*(reg32 *) UART1_SCB__INTR_SPI_EC)
    #define UART1_INTR_SPI_EC_PTR        ( (reg32 *) UART1_SCB__INTR_SPI_EC)

    #define UART1_INTR_SPI_EC_MASK_REG   (*(reg32 *) UART1_SCB__INTR_SPI_EC_MASK)
    #define UART1_INTR_SPI_EC_MASK_PTR   ( (reg32 *) UART1_SCB__INTR_SPI_EC_MASK)

    #define UART1_INTR_SPI_EC_MASKED_REG (*(reg32 *) UART1_SCB__INTR_SPI_EC_MASKED)
    #define UART1_INTR_SPI_EC_MASKED_PTR ( (reg32 *) UART1_SCB__INTR_SPI_EC_MASKED)
#endif /* (!UART1_CY_SCBIP_V1) */

#define UART1_INTR_MASTER_REG        (*(reg32 *) UART1_SCB__INTR_M)
#define UART1_INTR_MASTER_PTR        ( (reg32 *) UART1_SCB__INTR_M)

#define UART1_INTR_MASTER_SET_REG    (*(reg32 *) UART1_SCB__INTR_M_SET)
#define UART1_INTR_MASTER_SET_PTR    ( (reg32 *) UART1_SCB__INTR_M_SET)

#define UART1_INTR_MASTER_MASK_REG   (*(reg32 *) UART1_SCB__INTR_M_MASK)
#define UART1_INTR_MASTER_MASK_PTR   ( (reg32 *) UART1_SCB__INTR_M_MASK)

#define UART1_INTR_MASTER_MASKED_REG (*(reg32 *) UART1_SCB__INTR_M_MASKED)
#define UART1_INTR_MASTER_MASKED_PTR ( (reg32 *) UART1_SCB__INTR_M_MASKED)

#define UART1_INTR_SLAVE_REG         (*(reg32 *) UART1_SCB__INTR_S)
#define UART1_INTR_SLAVE_PTR         ( (reg32 *) UART1_SCB__INTR_S)

#define UART1_INTR_SLAVE_SET_REG     (*(reg32 *) UART1_SCB__INTR_S_SET)
#define UART1_INTR_SLAVE_SET_PTR     ( (reg32 *) UART1_SCB__INTR_S_SET)

#define UART1_INTR_SLAVE_MASK_REG    (*(reg32 *) UART1_SCB__INTR_S_MASK)
#define UART1_INTR_SLAVE_MASK_PTR    ( (reg32 *) UART1_SCB__INTR_S_MASK)

#define UART1_INTR_SLAVE_MASKED_REG  (*(reg32 *) UART1_SCB__INTR_S_MASKED)
#define UART1_INTR_SLAVE_MASKED_PTR  ( (reg32 *) UART1_SCB__INTR_S_MASKED)

#define UART1_INTR_TX_REG            (*(reg32 *) UART1_SCB__INTR_TX)
#define UART1_INTR_TX_PTR            ( (reg32 *) UART1_SCB__INTR_TX)

#define UART1_INTR_TX_SET_REG        (*(reg32 *) UART1_SCB__INTR_TX_SET)
#define UART1_INTR_TX_SET_PTR        ( (reg32 *) UART1_SCB__INTR_TX_SET)

#define UART1_INTR_TX_MASK_REG       (*(reg32 *) UART1_SCB__INTR_TX_MASK)
#define UART1_INTR_TX_MASK_PTR       ( (reg32 *) UART1_SCB__INTR_TX_MASK)

#define UART1_INTR_TX_MASKED_REG     (*(reg32 *) UART1_SCB__INTR_TX_MASKED)
#define UART1_INTR_TX_MASKED_PTR     ( (reg32 *) UART1_SCB__INTR_TX_MASKED)

#define UART1_INTR_RX_REG            (*(reg32 *) UART1_SCB__INTR_RX)
#define UART1_INTR_RX_PTR            ( (reg32 *) UART1_SCB__INTR_RX)

#define UART1_INTR_RX_SET_REG        (*(reg32 *) UART1_SCB__INTR_RX_SET)
#define UART1_INTR_RX_SET_PTR        ( (reg32 *) UART1_SCB__INTR_RX_SET)

#define UART1_INTR_RX_MASK_REG       (*(reg32 *) UART1_SCB__INTR_RX_MASK)
#define UART1_INTR_RX_MASK_PTR       ( (reg32 *) UART1_SCB__INTR_RX_MASK)

#define UART1_INTR_RX_MASKED_REG     (*(reg32 *) UART1_SCB__INTR_RX_MASKED)
#define UART1_INTR_RX_MASKED_PTR     ( (reg32 *) UART1_SCB__INTR_RX_MASKED)

/* Defines get from SCB IP parameters. */
#define UART1_FIFO_SIZE      (8u)  /* TX or RX FIFO size. */
#define UART1_EZ_DATA_NR     (32u)  /* Number of words in EZ memory. */ 
#define UART1_ONE_BYTE_WIDTH (8u)            /* Number of bits in one byte. */
#define UART1_FF_DATA_NR_LOG2_MASK       (0x0Fu)      /* Number of bits to represent a FIFO address. */
#define UART1_FF_DATA_NR_LOG2_PLUS1_MASK (0x1Fu) /* Number of bits to represent #bytes in FIFO. */


/***************************************
*        Registers Constants
***************************************/

#if (UART1_SCB_IRQ_INTERNAL)
    #define UART1_ISR_NUMBER     ((uint8) UART1_SCB_IRQ__INTC_NUMBER)
    #define UART1_ISR_PRIORITY   ((uint8) UART1_SCB_IRQ__INTC_PRIOR_NUM)
#endif /* (UART1_SCB_IRQ_INTERNAL) */

#if (UART1_UART_RX_WAKEUP_IRQ)
    #define UART1_RX_WAKE_ISR_NUMBER     ((uint8) UART1_RX_WAKEUP_IRQ__INTC_NUMBER)
    #define UART1_RX_WAKE_ISR_PRIORITY   ((uint8) UART1_RX_WAKEUP_IRQ__INTC_PRIOR_NUM)
#endif /* (UART1_UART_RX_WAKEUP_IRQ) */

/* UART1_CTRL_REG */
#define UART1_CTRL_OVS_POS           (0u)  /* [3:0]   Oversampling factor                 */
#define UART1_CTRL_EC_AM_MODE_POS    (8u)  /* [8]     Externally clocked address match    */
#define UART1_CTRL_EC_OP_MODE_POS    (9u)  /* [9]     Externally clocked operation mode   */
#define UART1_CTRL_EZBUF_MODE_POS    (10u) /* [10]    EZ buffer is enabled                */
#if !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
    #define UART1_CTRL_BYTE_MODE_POS (11u) /* [11]    Determines the number of bits per FIFO data element */
#endif /* !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */
#define UART1_CTRL_ADDR_ACCEPT_POS   (16u) /* [16]    Put matched address in RX FIFO       */
#define UART1_CTRL_BLOCK_POS         (17u) /* [17]    Ext and Int logic to resolve collide */
#define UART1_CTRL_MODE_POS          (24u) /* [25:24] Operation mode                       */
#define UART1_CTRL_ENABLED_POS       (31u) /* [31]    Enable SCB block                     */
#define UART1_CTRL_OVS_MASK          ((uint32) 0x0Fu)
#define UART1_CTRL_EC_AM_MODE        ((uint32) 0x01u << UART1_CTRL_EC_AM_MODE_POS)
#define UART1_CTRL_EC_OP_MODE        ((uint32) 0x01u << UART1_CTRL_EC_OP_MODE_POS)
#define UART1_CTRL_EZBUF_MODE        ((uint32) 0x01u << UART1_CTRL_EZBUF_MODE_POS)
#if !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
    #define UART1_CTRL_BYTE_MODE ((uint32) 0x01u << UART1_CTRL_BYTE_MODE_POS)
#endif /* !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */
#define UART1_CTRL_ADDR_ACCEPT       ((uint32) 0x01u << UART1_CTRL_ADDR_ACCEPT_POS)
#define UART1_CTRL_BLOCK             ((uint32) 0x01u << UART1_CTRL_BLOCK_POS)
#define UART1_CTRL_MODE_MASK         ((uint32) 0x03u << UART1_CTRL_MODE_POS)
#define UART1_CTRL_MODE_I2C          ((uint32) 0x00u)
#define UART1_CTRL_MODE_SPI          ((uint32) 0x01u << UART1_CTRL_MODE_POS)
#define UART1_CTRL_MODE_UART         ((uint32) 0x02u << UART1_CTRL_MODE_POS)
#define UART1_CTRL_ENABLED           ((uint32) 0x01u << UART1_CTRL_ENABLED_POS)

/* UART1_STATUS_REG */
#define UART1_STATUS_EC_BUSY_POS     (0u)  /* [0] Bus busy. Externally clocked logic access to EZ memory */
#define UART1_STATUS_EC_BUSY         ((uint32) 0x0Fu)

