gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
/* UART1_SPI_CTRL_REG  */
#define UART1_SPI_CTRL_CONTINUOUS_POS        (0u)  /* [0]     Continuous or Separated SPI data transfers */
#define UART1_SPI_CTRL_SELECT_PRECEDE_POS    (1u)  /* [1]     Precedes or coincides start of data frame  */
#define UART1_SPI_CTRL_CPHA_POS              (2u)  /* [2]     SCLK phase                                 */
#define UART1_SPI_CTRL_CPOL_POS              (3u)  /* [3]     SCLK polarity                              */
#define UART1_SPI_CTRL_LATE_MISO_SAMPLE_POS  (4u)  /* [4]     Late MISO sample enabled                   */
#if !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
    #define UART1_SPI_CTRL_SCLK_CONTINUOUS_POS   (5u)  /* [5]     Enable continuous SCLK generation */
    #define UART1_SPI_CTRL_SSEL0_POLARITY_POS    (8u)  /* [8]     SS0 polarity                      */
    #define UART1_SPI_CTRL_SSEL1_POLARITY_POS    (9u)  /* [9]     SS1 polarity                      */
    #define UART1_SPI_CTRL_SSEL2_POLARITY_POS    (10u) /* [10]    SS2 polarity                      */
    #define UART1_SPI_CTRL_SSEL3_POLARITY_POS    (11u) /* [11]    SS3 polarity                      */
#endif /* !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */
#define UART1_SPI_CTRL_LOOPBACK_POS          (16u) /* [16]    Local loop-back control enabled            */
#define UART1_SPI_CTRL_MODE_POS              (24u) /* [25:24] Submode of SPI operation                   */
#define UART1_SPI_CTRL_SLAVE_SELECT_POS      (26u) /* [27:26] Selects SPI SS signal                      */
#define UART1_SPI_CTRL_MASTER_MODE_POS       (31u) /* [31]    Master mode enabled                        */
#define UART1_SPI_CTRL_CONTINUOUS            ((uint32) 0x01u)
#define UART1_SPI_CTRL_SELECT_PRECEDE        ((uint32) 0x01u << UART1_SPI_CTRL_SELECT_PRECEDE_POS)
#define UART1_SPI_CTRL_SCLK_MODE_MASK        ((uint32) 0x03u << UART1_SPI_CTRL_CPHA_POS)
#define UART1_SPI_CTRL_CPHA                  ((uint32) 0x01u << UART1_SPI_CTRL_CPHA_POS)
#define UART1_SPI_CTRL_CPOL                  ((uint32) 0x01u << UART1_SPI_CTRL_CPOL_POS)
#define UART1_SPI_CTRL_LATE_MISO_SAMPLE      ((uint32) 0x01u << \
                                                                    UART1_SPI_CTRL_LATE_MISO_SAMPLE_POS)
#if !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
    #define UART1_SPI_CTRL_SCLK_CONTINUOUS  ((uint32) 0x01u << UART1_SPI_CTRL_SCLK_CONTINUOUS_POS)
    #define UART1_SPI_CTRL_SSEL0_POLARITY   ((uint32) 0x01u << UART1_SPI_CTRL_SSEL0_POLARITY_POS)
    #define UART1_SPI_CTRL_SSEL1_POLARITY   ((uint32) 0x01u << UART1_SPI_CTRL_SSEL1_POLARITY_POS)
    #define UART1_SPI_CTRL_SSEL2_POLARITY   ((uint32) 0x01u << UART1_SPI_CTRL_SSEL2_POLARITY_POS)
    #define UART1_SPI_CTRL_SSEL3_POLARITY   ((uint32) 0x01u << UART1_SPI_CTRL_SSEL3_POLARITY_POS)
    #define UART1_SPI_CTRL_SSEL_POLARITY_MASK ((uint32)0x0Fu << UART1_SPI_CTRL_SSEL0_POLARITY_POS)
#endif /* !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */

#define UART1_SPI_CTRL_LOOPBACK              ((uint32) 0x01u << UART1_SPI_CTRL_LOOPBACK_POS)
#define UART1_SPI_CTRL_MODE_MASK             ((uint32) 0x03u << UART1_SPI_CTRL_MODE_POS)
#define UART1_SPI_CTRL_MODE_MOTOROLA         ((uint32) 0x00u)
#define UART1_SPI_CTRL_MODE_TI               ((uint32) 0x01u << UART1_CTRL_MODE_POS)
#define UART1_SPI_CTRL_MODE_NS               ((uint32) 0x02u << UART1_CTRL_MODE_POS)
#define UART1_SPI_CTRL_SLAVE_SELECT_MASK     ((uint32) 0x03u << UART1_SPI_CTRL_SLAVE_SELECT_POS)
#define UART1_SPI_CTRL_SLAVE_SELECT0         ((uint32) 0x00u)
#define UART1_SPI_CTRL_SLAVE_SELECT1         ((uint32) 0x01u << UART1_SPI_CTRL_SLAVE_SELECT_POS)
#define UART1_SPI_CTRL_SLAVE_SELECT2         ((uint32) 0x02u << UART1_SPI_CTRL_SLAVE_SELECT_POS)
#define UART1_SPI_CTRL_SLAVE_SELECT3         ((uint32) 0x03u << UART1_SPI_CTRL_SLAVE_SELECT_POS)
#define UART1_SPI_CTRL_MASTER                ((uint32) 0x01u << UART1_SPI_CTRL_MASTER_MODE_POS)
#define UART1_SPI_CTRL_SLAVE                 ((uint32) 0x00u)

/* UART1_SPI_STATUS_REG  */
#define UART1_SPI_STATUS_BUS_BUSY_POS    (0u)  /* [0]    Bus busy - slave selected */
#define UART1_SPI_STATUS_EZBUF_ADDR_POS  (8u)  /* [15:8] EzAddress                 */
#define UART1_SPI_STATUS_BUS_BUSY        ((uint32) 0x01u)
#define UART1_SPI_STATUS_EZBUF_ADDR_MASK ((uint32) 0xFFu << UART1_I2C_STATUS_EZBUF_ADDR_POS)

/* UART1_UART_CTRL */
#define UART1_UART_CTRL_LOOPBACK_POS         (16u) /* [16] Loop-back    */
#define UART1_UART_CTRL_MODE_POS             (24u) /* [24] UART subMode */
#define UART1_UART_CTRL_LOOPBACK             ((uint32) 0x01u << UART1_UART_CTRL_LOOPBACK_POS)
#define UART1_UART_CTRL_MODE_UART_STD        ((uint32) 0x00u)
#define UART1_UART_CTRL_MODE_UART_SMARTCARD  ((uint32) 0x01u << UART1_UART_CTRL_MODE_POS)
#define UART1_UART_CTRL_MODE_UART_IRDA       ((uint32) 0x02u << UART1_UART_CTRL_MODE_POS)
#define UART1_UART_CTRL_MODE_MASK            ((uint32) 0x03u << UART1_UART_CTRL_MODE_POS)

/* UART1_UART_TX_CTRL */
#define UART1_UART_TX_CTRL_STOP_BITS_POS         (0u)  /* [2:0] Stop bits: (Stop bits + 1) * 0.5 period */
#define UART1_UART_TX_CTRL_PARITY_POS            (4u)  /* [4]   Parity bit                              */
#define UART1_UART_TX_CTRL_PARITY_ENABLED_POS    (5u)  /* [5]   Parity enable                           */
#define UART1_UART_TX_CTRL_RETRY_ON_NACK_POS     (8u)  /* [8]   Smart Card: re-send frame on NACK       */
#define UART1_UART_TX_CTRL_ONE_STOP_BIT          ((uint32) 0x01u)
#define UART1_UART_TX_CTRL_ONE_HALF_STOP_BITS    ((uint32) 0x02u)
#define UART1_UART_TX_CTRL_TWO_STOP_BITS         ((uint32) 0x03u)
#define UART1_UART_TX_CTRL_STOP_BITS_MASK        ((uint32) 0x07u)
#define UART1_UART_TX_CTRL_PARITY                ((uint32) 0x01u << \
                                                                    UART1_UART_TX_CTRL_PARITY_POS)
#define UART1_UART_TX_CTRL_PARITY_ENABLED        ((uint32) 0x01u << \
                                                                    UART1_UART_TX_CTRL_PARITY_ENABLED_POS)
#define UART1_UART_TX_CTRL_RETRY_ON_NACK         ((uint32) 0x01u << \
                                                                    UART1_UART_TX_CTRL_RETRY_ON_NACK_POS)

/* UART1_UART_RX_CTRL */
#define UART1_UART_RX_CTRL_STOP_BITS_POS             (0u)  /* [2:0] Stop bits: (Stop bits + 1) * 0.5 period*/
#define UART1_UART_RX_CTRL_PARITY_POS                (4u)  /* [4]   Parity bit                             */
#define UART1_UART_RX_CTRL_PARITY_ENABLED_POS        (5u)  /* [5]   Parity enable                          */
#define UART1_UART_RX_CTRL_POLARITY_POS              (6u)  /* [6]   IrDA: inverts polarity of RX signal    */
#define UART1_UART_RX_CTRL_DROP_ON_PARITY_ERR_POS    (8u)  /* [8]   Drop and lost RX FIFO on parity error  */
#define UART1_UART_RX_CTRL_DROP_ON_FRAME_ERR_POS     (9u)  /* [9]   Drop and lost RX FIFO on frame error   */
#define UART1_UART_RX_CTRL_MP_MODE_POS               (10u) /* [10]  Multi-processor mode                   */
#define UART1_UART_RX_CTRL_LIN_MODE_POS              (12u) /* [12]  Lin mode: applicable for UART Standard */
#define UART1_UART_RX_CTRL_SKIP_START_POS            (13u) /* [13]  Skip start not: only for UART Standard */
#define UART1_UART_RX_CTRL_BREAK_WIDTH_POS           (16u) /* [19:16]  Break width: (Break width + 1)      */
#define UART1_UART_TX_CTRL_ONE_STOP_BIT              ((uint32) 0x01u)
#define UART1_UART_TX_CTRL_ONE_HALF_STOP_BITS        ((uint32) 0x02u)
#define UART1_UART_TX_CTRL_TWO_STOP_BITS             ((uint32) 0x03u)
#define UART1_UART_RX_CTRL_STOP_BITS_MASK            ((uint32) 0x07u)
#define UART1_UART_RX_CTRL_PARITY                    ((uint32) 0x01u << \
                                                                    UART1_UART_RX_CTRL_PARITY_POS)
#define UART1_UART_RX_CTRL_PARITY_ENABLED            ((uint32) 0x01u << \
                                                                    UART1_UART_RX_CTRL_PARITY_ENABLED_POS)
#define UART1_UART_RX_CTRL_POLARITY                  ((uint32) 0x01u << \
                                                                    UART1_UART_RX_CTRL_POLARITY_POS)
#define UART1_UART_RX_CTRL_DROP_ON_PARITY_ERR        ((uint32) 0x01u << \
                                                                   UART1_UART_RX_CTRL_DROP_ON_PARITY_ERR_POS)
#define UART1_UART_RX_CTRL_DROP_ON_FRAME_ERR         ((uint32) 0x01u << \
                                                                    UART1_UART_RX_CTRL_DROP_ON_FRAME_ERR_POS)
#define UART1_UART_RX_CTRL_MP_MODE                   ((uint32) 0x01u << \
                                                                    UART1_UART_RX_CTRL_MP_MODE_POS)
#define UART1_UART_RX_CTRL_LIN_MODE                  ((uint32) 0x01u << \
                                                                    UART1_UART_RX_CTRL_LIN_MODE_POS)
#define UART1_UART_RX_CTRL_SKIP_START                ((uint32) 0x01u << \
                                                                    UART1_UART_RX_CTRL_SKIP_START_POS)
#define UART1_UART_RX_CTRL_BREAK_WIDTH_MASK          ((uint32) 0x0Fu << \
                                                                    UART1_UART_RX_CTRL_BREAK_WIDTH_POS)
/* UART1_UART_RX_STATUS_REG */
#define UART1_UART_RX_STATUS_BR_COUNTER_POS     (0u)  /* [11:0] Baud Rate counter */
#define UART1_UART_RX_STATUS_BR_COUNTER_MASK    ((uint32) 0xFFFu)

#if !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
    /* UART1_UART_FLOW_CTRL_REG */
    #define UART1_UART_FLOW_CTRL_TRIGGER_LEVEL_POS    (0u)  /* [7:0] RTS RX FIFO trigger level         */
    #define UART1_UART_FLOW_CTRL_RTS_POLARITY_POS     (16u) /* [16]  Polarity of the RTS output signal */
    #define UART1_UART_FLOW_CTRL_CTS_POLARITY_POS     (24u) /* [24]  Polarity of the CTS input signal  */
    #define UART1_UART_FLOW_CTRL_CTS_ENABLED_POS      (25u) /* [25]  Enable CTS signal                 */
    #define UART1_UART_FLOW_CTRL_TRIGGER_LEVEL_MASK   ((uint32) UART1_FF_DATA_NR_LOG2_MASK)
    #define UART1_UART_FLOW_CTRL_RTS_POLARITY         ((uint32) 0x01u << \
                                                                       UART1_UART_FLOW_CTRL_RTS_POLARITY_POS)
    #define UART1_UART_FLOW_CTRL_CTS_POLARITY         ((uint32) 0x01u << \
                                                                       UART1_UART_FLOW_CTRL_CTS_POLARITY_POS)
    #define UART1_UART_FLOW_CTRL_CTS_ENABLE           ((uint32) 0x01u << \
                                                                       UART1_UART_FLOW_CTRL_CTS_ENABLED_POS)
#endif /* !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */

/* UART1_I2C_CTRL */
#define UART1_I2C_CTRL_HIGH_PHASE_OVS_POS           (0u)   /* [3:0] Oversampling factor high: master only */
#define UART1_I2C_CTRL_LOW_PHASE_OVS_POS            (4u)   /* [7:4] Oversampling factor low:  master only */
#define UART1_I2C_CTRL_M_READY_DATA_ACK_POS         (8u)   /* [8]   Master ACKs data while RX FIFO != FULL*/
#define UART1_I2C_CTRL_M_NOT_READY_DATA_NACK_POS    (9u)   /* [9]   Master NACKs data if RX FIFO ==  FULL */
#define UART1_I2C_CTRL_S_GENERAL_IGNORE_POS         (11u)  /* [11]  Slave ignores General call            */
#define UART1_I2C_CTRL_S_READY_ADDR_ACK_POS         (12u)  /* [12]  Slave ACKs Address if RX FIFO != FULL */
#define UART1_I2C_CTRL_S_READY_DATA_ACK_POS         (13u)  /* [13]  Slave ACKs data while RX FIFO == FULL */
#define UART1_I2C_CTRL_S_NOT_READY_ADDR_NACK_POS    (14u)  /* [14]  Slave NACKs address if RX FIFO == FULL*/
#define UART1_I2C_CTRL_S_NOT_READY_DATA_NACK_POS    (15u)  /* [15]  Slave NACKs data if RX FIFO is  FULL  */
#define UART1_I2C_CTRL_LOOPBACK_POS                 (16u)  /* [16]  Loop-back                             */
#define UART1_I2C_CTRL_SLAVE_MODE_POS               (30u)  /* [30]  Slave mode enabled                    */
#define UART1_I2C_CTRL_MASTER_MODE_POS              (31u)  /* [31]  Master mode enabled                   */
#define UART1_I2C_CTRL_HIGH_PHASE_OVS_MASK  ((uint32) 0x0Fu)
#define UART1_I2C_CTRL_LOW_PHASE_OVS_MASK   ((uint32) 0x0Fu << \
                                                                UART1_I2C_CTRL_LOW_PHASE_OVS_POS)
#define UART1_I2C_CTRL_M_READY_DATA_ACK      ((uint32) 0x01u << \
                                                                UART1_I2C_CTRL_M_READY_DATA_ACK_POS)
#define UART1_I2C_CTRL_M_NOT_READY_DATA_NACK ((uint32) 0x01u << \
                                                                UART1_I2C_CTRL_M_NOT_READY_DATA_NACK_POS)
#define UART1_I2C_CTRL_S_GENERAL_IGNORE      ((uint32) 0x01u << \
                                                                UART1_I2C_CTRL_S_GENERAL_IGNORE_POS)
#define UART1_I2C_CTRL_S_READY_ADDR_ACK      ((uint32) 0x01u << \
                                                                UART1_I2C_CTRL_S_READY_ADDR_ACK_POS)
#define UART1_I2C_CTRL_S_READY_DATA_ACK      ((uint32) 0x01u << \
                                                                UART1_I2C_CTRL_S_READY_DATA_ACK_POS)
#define UART1_I2C_CTRL_S_NOT_READY_ADDR_NACK ((uint32) 0x01u << \
                                                                UART1_I2C_CTRL_S_NOT_READY_ADDR_NACK_POS)
#define UART1_I2C_CTRL_S_NOT_READY_DATA_NACK ((uint32) 0x01u << \
                                                                UART1_I2C_CTRL_S_NOT_READY_DATA_NACK_POS)
#define UART1_I2C_CTRL_LOOPBACK              ((uint32) 0x01u << \
                                                                UART1_I2C_CTRL_LOOPBACK_POS)
#define UART1_I2C_CTRL_SLAVE_MODE            ((uint32) 0x01u << \
                                                                UART1_I2C_CTRL_SLAVE_MODE_POS)
#define UART1_I2C_CTRL_MASTER_MODE           ((uint32) 0x01u << \
                                                                UART1_I2C_CTRL_MASTER_MODE_POS)
#define UART1_I2C_CTRL_SLAVE_MASTER_MODE_MASK    ((uint32) 0x03u << \
                                                                UART1_I2C_CTRL_SLAVE_MODE_POS)

/* UART1_I2C_STATUS_REG  */
#define UART1_I2C_STATUS_BUS_BUSY_POS    (0u)  /* [0]    Bus busy: internally clocked */
#define UART1_I2C_STATUS_S_READ_POS      (4u)  /* [4]    Slave is read by master      */
#define UART1_I2C_STATUS_M_READ_POS      (5u)  /* [5]    Master reads Slave           */
#define UART1_I2C_STATUS_EZBUF_ADDR_POS  (8u)  /* [15:8] EZAddress                    */
#define UART1_I2C_STATUS_BUS_BUSY        ((uint32) 0x01u)
#define UART1_I2C_STATUS_S_READ          ((uint32) 0x01u << UART1_I2C_STATUS_S_READ_POS)
#define UART1_I2C_STATUS_M_READ          ((uint32) 0x01u << UART1_I2C_STATUS_M_READ_POS)
#define UART1_I2C_STATUS_EZBUF_ADDR_MASK ((uint32) 0xFFu << UART1_I2C_STATUS_EZBUF_ADDR_POS)

/* UART1_I2C_MASTER_CMD_REG */
#define UART1_I2C_MASTER_CMD_M_START_POS             (0u)  /* [0] Master generate Start                */
#define UART1_I2C_MASTER_CMD_M_START_ON_IDLE_POS     (1u)  /* [1] Master generate Start if bus is free */
#define UART1_I2C_MASTER_CMD_M_ACK_POS               (2u)  /* [2] Master generate ACK                  */
#define UART1_I2C_MASTER_CMD_M_NACK_POS              (3u)  /* [3] Master generate NACK                 */
#define UART1_I2C_MASTER_CMD_M_STOP_POS              (4u)  /* [4] Master generate Stop                 */
#define UART1_I2C_MASTER_CMD_M_START         ((uint32) 0x01u)
#define UART1_I2C_MASTER_CMD_M_START_ON_IDLE ((uint32) 0x01u << \
                                                                   UART1_I2C_MASTER_CMD_M_START_ON_IDLE_POS)
#define UART1_I2C_MASTER_CMD_M_ACK           ((uint32) 0x01u << \
                                                                   UART1_I2C_MASTER_CMD_M_ACK_POS)
#define UART1_I2C_MASTER_CMD_M_NACK          ((uint32) 0x01u << \
                                                                    UART1_I2C_MASTER_CMD_M_NACK_POS)
#define UART1_I2C_MASTER_CMD_M_STOP          ((uint32) 0x01u << \
                                                                    UART1_I2C_MASTER_CMD_M_STOP_POS)

