gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
/* UART1_I2C_SLAVE_CMD_REG  */
#define UART1_I2C_SLAVE_CMD_S_ACK_POS    (0u)  /* [0] Slave generate ACK  */
#define UART1_I2C_SLAVE_CMD_S_NACK_POS   (1u)  /* [1] Slave generate NACK */
#define UART1_I2C_SLAVE_CMD_S_ACK        ((uint32) 0x01u)
#define UART1_I2C_SLAVE_CMD_S_NACK       ((uint32) 0x01u << UART1_I2C_SLAVE_CMD_S_NACK_POS)

#define UART1_I2C_SLAVE_CMD_S_ACK_POS    (0u)  /* [0] Slave generate ACK  */
#define UART1_I2C_SLAVE_CMD_S_NACK_POS   (1u)  /* [1] Slave generate NACK */
#define UART1_I2C_SLAVE_CMD_S_ACK        ((uint32) 0x01u)
#define UART1_I2C_SLAVE_CMD_S_NACK       ((uint32) 0x01u << UART1_I2C_SLAVE_CMD_S_NACK_POS)

/* UART1_I2C_CFG_REG */
#if (UART1_CY_SCBIP_V0)
#define UART1_I2C_CFG_SDA_FILT_HYS_POS           (0u)  /* [1:0]   Trim bits for the I2C SDA filter         */
#define UART1_I2C_CFG_SDA_FILT_TRIM_POS          (2u)  /* [3:2]   Trim bits for the I2C SDA filter         */
#define UART1_I2C_CFG_SCL_FILT_HYS_POS           (4u)  /* [5:4]   Trim bits for the I2C SCL filter         */
#define UART1_I2C_CFG_SCL_FILT_TRIM_POS          (6u)  /* [7:6]   Trim bits for the I2C SCL filter         */
#define UART1_I2C_CFG_SDA_FILT_OUT_HYS_POS       (8u)  /* [9:8]   Trim bits for I2C SDA filter output path */
#define UART1_I2C_CFG_SDA_FILT_OUT_TRIM_POS      (10u) /* [11:10] Trim bits for I2C SDA filter output path */
#define UART1_I2C_CFG_SDA_FILT_HS_POS            (16u) /* [16]    '0': 50 ns filter, '1': 10 ns filter     */
#define UART1_I2C_CFG_SDA_FILT_ENABLED_POS       (17u) /* [17]    I2C SDA filter enabled                   */
#define UART1_I2C_CFG_SCL_FILT_HS_POS            (24u) /* [24]    '0': 50 ns filter, '1': 10 ns filter     */
#define UART1_I2C_CFG_SCL_FILT_ENABLED_POS       (25u) /* [25]    I2C SCL filter enabled                   */
#define UART1_I2C_CFG_SDA_FILT_OUT_HS_POS        (26u) /* [26]    '0': 50 ns filter, '1': 10 ns filter     */
#define UART1_I2C_CFG_SDA_FILT_OUT_ENABLED_POS   (27u) /* [27]    I2C SDA output delay filter enabled      */
#define UART1_I2C_CFG_SDA_FILT_HYS_MASK          ((uint32) 0x03u)
#define UART1_I2C_CFG_SDA_FILT_TRIM_MASK         ((uint32) 0x03u << \
                                                                UART1_I2C_CFG_SDA_FILT_TRIM_POS)
#define UART1_I2C_CFG_SCL_FILT_HYS_MASK          ((uint32) 0x03u << \
                                                                UART1_I2C_CFG_SCL_FILT_HYS_POS)
#define UART1_I2C_CFG_SCL_FILT_TRIM_MASK         ((uint32) 0x03u << \
                                                                UART1_I2C_CFG_SCL_FILT_TRIM_POS)
#define UART1_I2C_CFG_SDA_FILT_OUT_HYS_MASK      ((uint32) 0x03u << \
                                                                UART1_I2C_CFG_SDA_FILT_OUT_HYS_POS)
#define UART1_I2C_CFG_SDA_FILT_OUT_TRIM_MASK     ((uint32) 0x03u << \
                                                                UART1_I2C_CFG_SDA_FILT_OUT_TRIM_POS)
#define UART1_I2C_CFG_SDA_FILT_HS                ((uint32) 0x01u << \
                                                                UART1_I2C_CFG_SDA_FILT_HS_POS)
#define UART1_I2C_CFG_SDA_FILT_ENABLED           ((uint32) 0x01u << \
                                                                UART1_I2C_CFG_SDA_FILT_ENABLED_POS)
#define UART1_I2C_CFG_SCL_FILT_HS                ((uint32) 0x01u << \
                                                                UART1_I2C_CFG_SCL_FILT_HS_POS)
#define UART1_I2C_CFG_SCL_FILT_ENABLED           ((uint32) 0x01u << \
                                                                UART1_I2C_CFG_SCL_FILT_ENABLED_POS)
#define UART1_I2C_CFG_SDA_FILT_OUT_HS            ((uint32) 0x01u << \
                                                                UART1_I2C_CFG_SDA_FILT_OUT_HS_POS)
#define UART1_I2C_CFG_SDA_FILT_OUT_ENABLED       ((uint32) 0x01u << \
                                                                UART1_I2C_CFG_SDA_FILT_OUT_ENABLED_POS)
#else
#define UART1_I2C_CFG_SDA_IN_FILT_TRIM_POS   (0u)  /* [1:0] Trim bits for "i2c_sda_in" 50 ns filter */
#define UART1_I2C_CFG_SDA_IN_FILT_SEL_POS    (4u)  /* [4]   "i2c_sda_in" filter delay: 0 ns and 50 ns */
#define UART1_I2C_CFG_SCL_IN_FILT_TRIM_POS   (8u)  /* [9:8] Trim bits for "i2c_scl_in" 50 ns filter */
#define UART1_I2C_CFG_SCL_IN_FILT_SEL_POS    (12u) /* [12]  "i2c_scl_in" filter delay: 0 ns and 50 ns */
#define UART1_I2C_CFG_SDA_OUT_FILT0_TRIM_POS (16u) /* [17:16] Trim bits for "i2c_sda_out" 50 ns filter 0 */
#define UART1_I2C_CFG_SDA_OUT_FILT1_TRIM_POS (18u) /* [19:18] Trim bits for "i2c_sda_out" 50 ns filter 1 */
#define UART1_I2C_CFG_SDA_OUT_FILT2_TRIM_POS (20u) /* [21:20] Trim bits for "i2c_sda_out" 50 ns filter 2 */
#define UART1_I2C_CFG_SDA_OUT_FILT_SEL_POS   (28u) /* [29:28] Cumulative "i2c_sda_out" filter delay: */

#define UART1_I2C_CFG_SDA_IN_FILT_TRIM_MASK  ((uint32) 0x03u)
#define UART1_I2C_CFG_SDA_IN_FILT_SEL        ((uint32) 0x01u << UART1_I2C_CFG_SDA_IN_FILT_SEL_POS)
#define UART1_I2C_CFG_SCL_IN_FILT_TRIM_MASK  ((uint32) 0x03u << \
                                                            UART1_I2C_CFG_SCL_IN_FILT_TRIM_POS)
#define UART1_I2C_CFG_SCL_IN_FILT_SEL        ((uint32) 0x01u << UART1_I2C_CFG_SCL_IN_FILT_SEL_POS)
#define UART1_I2C_CFG_SDA_OUT_FILT0_TRIM_MASK ((uint32) 0x03u << \
                                                            UART1_I2C_CFG_SDA_OUT_FILT0_TRIM_POS)
#define UART1_I2C_CFG_SDA_OUT_FILT1_TRIM_MASK ((uint32) 0x03u << \
                                                            UART1_I2C_CFG_SDA_OUT_FILT1_TRIM_POS)
#define UART1_I2C_CFG_SDA_OUT_FILT2_TRIM_MASK ((uint32) 0x03u << \
                                                            UART1_I2C_CFG_SDA_OUT_FILT2_TRIM_POS)
#define UART1_I2C_CFG_SDA_OUT_FILT_SEL_MASK   ((uint32) 0x03u << \
                                                            UART1_I2C_CFG_SDA_OUT_FILT_SEL_POS)
#endif /* (UART1_CY_SCBIP_V0) */


/* UART1_TX_CTRL_REG */
#define UART1_TX_CTRL_DATA_WIDTH_POS     (0u)  /* [3:0] Data frame width: (Data width - 1) */
#define UART1_TX_CTRL_MSB_FIRST_POS      (8u)  /* [8]   MSB first shifter-out             */
#define UART1_TX_CTRL_ENABLED_POS        (31u) /* [31]  Transmitter enabled               */
#define UART1_TX_CTRL_DATA_WIDTH_MASK    ((uint32) 0x0Fu)
#define UART1_TX_CTRL_MSB_FIRST          ((uint32) 0x01u << UART1_TX_CTRL_MSB_FIRST_POS)
#define UART1_TX_CTRL_LSB_FIRST          ((uint32) 0x00u)
#define UART1_TX_CTRL_ENABLED            ((uint32) 0x01u << UART1_TX_CTRL_ENABLED_POS)

/* UART1_TX_CTRL_FIFO_REG */
#define UART1_TX_FIFO_CTRL_TRIGGER_LEVEL_POS     (0u)  /* [2:0] Trigger level                              */
#define UART1_TX_FIFO_CTRL_CLEAR_POS             (16u) /* [16]  Clear TX FIFO: cleared after set           */
#define UART1_TX_FIFO_CTRL_FREEZE_POS            (17u) /* [17]  Freeze TX FIFO: HW do not inc read pointer */
#define UART1_TX_FIFO_CTRL_TRIGGER_LEVEL_MASK    ((uint32) UART1_FF_DATA_NR_LOG2_MASK)
#define UART1_TX_FIFO_CTRL_CLEAR                 ((uint32) 0x01u << UART1_TX_FIFO_CTRL_CLEAR_POS)
#define UART1_TX_FIFO_CTRL_FREEZE                ((uint32) 0x01u << UART1_TX_FIFO_CTRL_FREEZE_POS)

/* UART1_TX_FIFO_STATUS_REG */
#define UART1_TX_FIFO_STATUS_USED_POS    (0u)  /* [3:0]   Amount of entries in TX FIFO */
#define UART1_TX_FIFO_SR_VALID_POS       (15u) /* [15]    Shifter status of TX FIFO    */
#define UART1_TX_FIFO_STATUS_RD_PTR_POS  (16u) /* [18:16] TX FIFO read pointer         */
#define UART1_TX_FIFO_STATUS_WR_PTR_POS  (24u) /* [26:24] TX FIFO write pointer        */
#define UART1_TX_FIFO_STATUS_USED_MASK   ((uint32) UART1_FF_DATA_NR_LOG2_PLUS1_MASK)
#define UART1_TX_FIFO_SR_VALID           ((uint32) 0x01u << UART1_TX_FIFO_SR_VALID_POS)
#define UART1_TX_FIFO_STATUS_RD_PTR_MASK ((uint32) UART1_FF_DATA_NR_LOG2_MASK << \
                                                                    UART1_TX_FIFO_STATUS_RD_PTR_POS)
#define UART1_TX_FIFO_STATUS_WR_PTR_MASK ((uint32) UART1_FF_DATA_NR_LOG2_MASK << \
                                                                    UART1_TX_FIFO_STATUS_WR_PTR_POS)

/* UART1_TX_FIFO_WR_REG */
#define UART1_TX_FIFO_WR_POS    (0u)  /* [15:0] Data written into TX FIFO */
#define UART1_TX_FIFO_WR_MASK   ((uint32) 0xFFu)

/* UART1_RX_CTRL_REG */
#define UART1_RX_CTRL_DATA_WIDTH_POS     (0u)  /* [3:0] Data frame width: (Data width - 1) */
#define UART1_RX_CTRL_MSB_FIRST_POS      (8u)  /* [8]   MSB first shifter-out             */
#define UART1_RX_CTRL_MEDIAN_POS         (9u)  /* [9]   Median filter                     */
#define UART1_RX_CTRL_ENABLED_POS        (31u) /* [31]  Receiver enabled                  */
#define UART1_RX_CTRL_DATA_WIDTH_MASK    ((uint32) 0x0Fu)
#define UART1_RX_CTRL_MSB_FIRST          ((uint32) 0x01u << UART1_RX_CTRL_MSB_FIRST_POS)
#define UART1_RX_CTRL_LSB_FIRST          ((uint32) 0x00u)
#define UART1_RX_CTRL_MEDIAN             ((uint32) 0x01u << UART1_RX_CTRL_MEDIAN_POS)
#define UART1_RX_CTRL_ENABLED            ((uint32) 0x01u << UART1_RX_CTRL_ENABLED_POS)


/* UART1_RX_FIFO_CTRL_REG */
#define UART1_RX_FIFO_CTRL_TRIGGER_LEVEL_POS     (0u)   /* [2:0] Trigger level                            */
#define UART1_RX_FIFO_CTRL_CLEAR_POS             (16u)  /* [16]  Clear RX FIFO: clear after set           */
#define UART1_RX_FIFO_CTRL_FREEZE_POS            (17u)  /* [17]  Freeze RX FIFO: HW writes has not effect */
#define UART1_RX_FIFO_CTRL_TRIGGER_LEVEL_MASK    ((uint32) UART1_FF_DATA_NR_LOG2_MASK)
#define UART1_RX_FIFO_CTRL_CLEAR                 ((uint32) 0x01u << UART1_RX_FIFO_CTRL_CLEAR_POS)
#define UART1_RX_FIFO_CTRL_FREEZE                ((uint32) 0x01u << UART1_RX_FIFO_CTRL_FREEZE_POS)

/* UART1_RX_FIFO_STATUS_REG */
#define UART1_RX_FIFO_STATUS_USED_POS    (0u)   /* [3:0]   Amount of entries in RX FIFO */
#define UART1_RX_FIFO_SR_VALID_POS       (15u)  /* [15]    Shifter status of RX FIFO    */
#define UART1_RX_FIFO_STATUS_RD_PTR_POS  (16u)  /* [18:16] RX FIFO read pointer         */
#define UART1_RX_FIFO_STATUS_WR_PTR_POS  (24u)  /* [26:24] RX FIFO write pointer        */
#define UART1_RX_FIFO_STATUS_USED_MASK   ((uint32) UART1_FF_DATA_NR_LOG2_PLUS1_MASK)
#define UART1_RX_FIFO_SR_VALID           ((uint32) 0x01u << UART1_RX_FIFO_SR_VALID_POS)
#define UART1_RX_FIFO_STATUS_RD_PTR_MASK ((uint32) UART1_FF_DATA_NR_LOG2_MASK << \
                                                                    UART1_RX_FIFO_STATUS_RD_PTR_POS)
#define UART1_RX_FIFO_STATUS_WR_PTR_MASK ((uint32) UART1_FF_DATA_NR_LOG2_MASK << \
                                                                    UART1_RX_FIFO_STATUS_WR_PTR_POS)

/* UART1_RX_MATCH_REG */
#define UART1_RX_MATCH_ADDR_POS     (0u)  /* [7:0]   Slave address                        */
#define UART1_RX_MATCH_MASK_POS     (16u) /* [23:16] Slave address mask: 0 - doesn't care */
#define UART1_RX_MATCH_ADDR_MASK    ((uint32) 0xFFu)
#define UART1_RX_MATCH_MASK_MASK    ((uint32) 0xFFu << UART1_RX_MATCH_MASK_POS)

/* UART1_RX_FIFO_WR_REG */
#define UART1_RX_FIFO_RD_POS    (0u)  /* [15:0] Data read from RX FIFO */
#define UART1_RX_FIFO_RD_MASK   ((uint32) 0xFFu)

/* UART1_RX_FIFO_RD_SILENT_REG */
#define UART1_RX_FIFO_RD_SILENT_POS     (0u)  /* [15:0] Data read from RX FIFO: not remove data from FIFO */
#define UART1_RX_FIFO_RD_SILENT_MASK    ((uint32) 0xFFu)

/* UART1_RX_FIFO_RD_SILENT_REG */
#define UART1_RX_FIFO_RD_SILENT_POS     (0u)  /* [15:0] Data read from RX FIFO: not remove data from FIFO */
#define UART1_RX_FIFO_RD_SILENT_MASK    ((uint32) 0xFFu)

/* UART1_EZBUF_DATA_REG */
#define UART1_EZBUF_DATA_POS   (0u)  /* [7:0] Data from EZ Memory */
#define UART1_EZBUF_DATA_MASK  ((uint32) 0xFFu)

/*  UART1_INTR_CAUSE_REG */
#define UART1_INTR_CAUSE_MASTER_POS  (0u)  /* [0] Master interrupt active                 */
#define UART1_INTR_CAUSE_SLAVE_POS   (1u)  /* [1] Slave interrupt active                  */
#define UART1_INTR_CAUSE_TX_POS      (2u)  /* [2] Transmitter interrupt active            */
#define UART1_INTR_CAUSE_RX_POS      (3u)  /* [3] Receiver interrupt active               */
#define UART1_INTR_CAUSE_I2C_EC_POS  (4u)  /* [4] Externally clock I2C interrupt active   */
#define UART1_INTR_CAUSE_SPI_EC_POS  (5u)  /* [5] Externally clocked SPI interrupt active */
#define UART1_INTR_CAUSE_MASTER      ((uint32) 0x01u)
#define UART1_INTR_CAUSE_SLAVE       ((uint32) 0x01u << UART1_INTR_CAUSE_SLAVE_POS)
#define UART1_INTR_CAUSE_TX          ((uint32) 0x01u << UART1_INTR_CAUSE_TX_POS)
#define UART1_INTR_CAUSE_RX          ((uint32) 0x01u << UART1_INTR_CAUSE_RX_POS)
#define UART1_INTR_CAUSE_I2C_EC      ((uint32) 0x01u << UART1_INTR_CAUSE_I2C_EC_POS)
#define UART1_INTR_CAUSE_SPI_EC      ((uint32) 0x01u << UART1_INTR_CAUSE_SPI_EC_POS)

/* UART1_INTR_SPI_EC_REG, UART1_INTR_SPI_EC_MASK_REG, UART1_INTR_SPI_EC_MASKED_REG */
#define UART1_INTR_SPI_EC_WAKE_UP_POS          (0u)  /* [0] Address match: triggers wakeup of chip */
#define UART1_INTR_SPI_EC_EZBUF_STOP_POS       (1u)  /* [1] Externally clocked Stop detected       */
#define UART1_INTR_SPI_EC_EZBUF_WRITE_STOP_POS (2u)  /* [2] Externally clocked Write Stop detected */
#define UART1_INTR_SPI_EC_WAKE_UP              ((uint32) 0x01u)
#define UART1_INTR_SPI_EC_EZBUF_STOP           ((uint32) 0x01u << \
                                                                    UART1_INTR_SPI_EC_EZBUF_STOP_POS)
#define UART1_INTR_SPI_EC_EZBUF_WRITE_STOP     ((uint32) 0x01u << \
                                                                    UART1_INTR_SPI_EC_EZBUF_WRITE_STOP_POS)

