gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
/* UART1_INTR_I2C_EC, UART1_INTR_I2C_EC_MASK, UART1_INTR_I2C_EC_MASKED */
#define UART1_INTR_I2C_EC_WAKE_UP_POS          (0u)  /* [0] Address match: triggers wakeup of chip */
#define UART1_INTR_I2C_EC_EZBUF_STOP_POS       (1u)  /* [1] Externally clocked Stop detected       */
#define UART1_INTR_I2C_EC_EZBUF_WRITE_STOP_POS (2u)  /* [2] Externally clocked Write Stop detected */
#define UART1_INTR_I2C_EC_WAKE_UP              ((uint32) 0x01u)
#define UART1_INTR_I2C_EC_EZBUF_STOP           ((uint32) 0x01u << \
                                                                    UART1_INTR_I2C_EC_EZBUF_STOP_POS)
#define UART1_INTR_I2C_EC_EZBUF_WRITE_STOP     ((uint32) 0x01u << \
                                                                    UART1_INTR_I2C_EC_EZBUF_WRITE_STOP_POS)

/* UART1_INTR_MASTER, UART1_INTR_MASTER_SET,
   UART1_INTR_MASTER_MASK, UART1_INTR_MASTER_MASKED */
#define UART1_INTR_MASTER_I2C_ARB_LOST_POS   (0u)  /* [0] Master lost arbitration                          */
#define UART1_INTR_MASTER_I2C_NACK_POS       (1u)  /* [1] Master receives NACK: address or write to slave  */
#define UART1_INTR_MASTER_I2C_ACK_POS        (2u)  /* [2] Master receives NACK: address or write to slave  */
#define UART1_INTR_MASTER_I2C_STOP_POS       (4u)  /* [4] Master detects the Stop: only self generated Stop*/
#define UART1_INTR_MASTER_I2C_BUS_ERROR_POS  (8u)  /* [8] Master detects bus error: misplaced Start or Stop*/
#define UART1_INTR_MASTER_SPI_DONE_POS       (9u)  /* [9] Master complete transfer: Only for SPI           */
#define UART1_INTR_MASTER_I2C_ARB_LOST       ((uint32) 0x01u)
#define UART1_INTR_MASTER_I2C_NACK           ((uint32) 0x01u << UART1_INTR_MASTER_I2C_NACK_POS)
#define UART1_INTR_MASTER_I2C_ACK            ((uint32) 0x01u << UART1_INTR_MASTER_I2C_ACK_POS)
#define UART1_INTR_MASTER_I2C_STOP           ((uint32) 0x01u << UART1_INTR_MASTER_I2C_STOP_POS)
#define UART1_INTR_MASTER_I2C_BUS_ERROR      ((uint32) 0x01u << \
                                                                    UART1_INTR_MASTER_I2C_BUS_ERROR_POS)
#define UART1_INTR_MASTER_SPI_DONE           ((uint32) 0x01u << UART1_INTR_MASTER_SPI_DONE_POS)

/*
* UART1_INTR_SLAVE, UART1_INTR_SLAVE_SET,
* UART1_INTR_SLAVE_MASK, UART1_INTR_SLAVE_MASKED
*/
#define UART1_INTR_SLAVE_I2C_ARB_LOST_POS         (0u)  /* [0]  Slave lost arbitration                   */
#define UART1_INTR_SLAVE_I2C_NACK_POS             (1u)  /* [1]  Slave receives NACK: master reads data   */
#define UART1_INTR_SLAVE_I2C_ACK_POS              (2u)  /* [2]  Slave receives ACK: master reads data    */
#define UART1_INTR_SLAVE_I2C_WRITE_STOP_POS       (3u)  /* [3]  Slave detects end of write transaction   */
#define UART1_INTR_SLAVE_I2C_STOP_POS             (4u)  /* [4]  Slave detects end of transaction intended */
#define UART1_INTR_SLAVE_I2C_START_POS            (5u)  /* [5]  Slave detects Start                      */
#define UART1_INTR_SLAVE_I2C_ADDR_MATCH_POS       (6u)  /* [6]  Slave address matches                    */
#define UART1_INTR_SLAVE_I2C_GENERAL_POS          (7u)  /* [7]  General call received                    */
#define UART1_INTR_SLAVE_I2C_BUS_ERROR_POS        (8u)  /* [8]  Slave detects bus error                  */
#define UART1_INTR_SLAVE_SPI_EZBUF_WRITE_STOP_POS (9u)  /* [9]  Slave write complete: Only for SPI       */
#define UART1_INTR_SLAVE_SPI_EZBUF_STOP_POS       (10u) /* [10] Slave end of transaction: Only for SPI   */
#define UART1_INTR_SLAVE_SPI_BUS_ERROR_POS        (11u) /* [11] Slave detects bus error: Only for SPI    */
#define UART1_INTR_SLAVE_I2C_ARB_LOST             ((uint32) 0x01u)
#define UART1_INTR_SLAVE_I2C_NACK                 ((uint32) 0x01u << \
                                                                    UART1_INTR_SLAVE_I2C_NACK_POS)
#define UART1_INTR_SLAVE_I2C_ACK                  ((uint32) 0x01u << \
                                                                    UART1_INTR_SLAVE_I2C_ACK_POS)
#define UART1_INTR_SLAVE_I2C_WRITE_STOP           ((uint32) 0x01u << \
                                                                    UART1_INTR_SLAVE_I2C_WRITE_STOP_POS)
#define UART1_INTR_SLAVE_I2C_STOP                 ((uint32) 0x01u << \
                                                                    UART1_INTR_SLAVE_I2C_STOP_POS)
#define UART1_INTR_SLAVE_I2C_START                ((uint32) 0x01u << \
                                                                    UART1_INTR_SLAVE_I2C_START_POS)
#define UART1_INTR_SLAVE_I2C_ADDR_MATCH           ((uint32) 0x01u << \
                                                                    UART1_INTR_SLAVE_I2C_ADDR_MATCH_POS)
#define UART1_INTR_SLAVE_I2C_GENERAL              ((uint32) 0x01u << \
                                                                    UART1_INTR_SLAVE_I2C_GENERAL_POS)
#define UART1_INTR_SLAVE_I2C_BUS_ERROR            ((uint32) 0x01u << \
                                                                    UART1_INTR_SLAVE_I2C_BUS_ERROR_POS)
#define UART1_INTR_SLAVE_SPI_EZBUF_WRITE_STOP     ((uint32) 0x01u << \
                                                                   UART1_INTR_SLAVE_SPI_EZBUF_WRITE_STOP_POS)
#define UART1_INTR_SLAVE_SPI_EZBUF_STOP           ((uint32) 0x01u << \
                                                                    UART1_INTR_SLAVE_SPI_EZBUF_STOP_POS)
#define UART1_INTR_SLAVE_SPI_BUS_ERROR           ((uint32) 0x01u << \
                                                                    UART1_INTR_SLAVE_SPI_BUS_ERROR_POS)

/*
* UART1_INTR_TX, UART1_INTR_TX_SET,
* UART1_INTR_TX_MASK, UART1_INTR_TX_MASKED
*/
#define UART1_INTR_TX_TRIGGER_POS        (0u)  /* [0]  Trigger on TX FIFO entires                       */
#define UART1_INTR_TX_NOT_FULL_POS       (1u)  /* [1]  TX FIFO is not full                              */
#define UART1_INTR_TX_EMPTY_POS          (4u)  /* [4]  TX FIFO is empty                                 */
#define UART1_INTR_TX_OVERFLOW_POS       (5u)  /* [5]  Attempt to write to a full TX FIFO               */
#define UART1_INTR_TX_UNDERFLOW_POS      (6u)  /* [6]  Attempt to read from an empty TX FIFO            */
#define UART1_INTR_TX_BLOCKED_POS        (7u)  /* [7]  No access to the EZ memory                       */
#define UART1_INTR_TX_UART_NACK_POS      (8u)  /* [8]  UART transmitter received a NACK: SmartCard mode */
#define UART1_INTR_TX_UART_DONE_POS      (9u)  /* [9]  UART transmitter done even                       */
#define UART1_INTR_TX_UART_ARB_LOST_POS  (10u) /* [10] UART lost arbitration: LIN or SmartCard          */
#define UART1_INTR_TX_TRIGGER            ((uint32) 0x01u)
#define UART1_INTR_TX_FIFO_LEVEL         (UART1_INTR_TX_TRIGGER)
#define UART1_INTR_TX_NOT_FULL           ((uint32) 0x01u << UART1_INTR_TX_NOT_FULL_POS)
#define UART1_INTR_TX_EMPTY              ((uint32) 0x01u << UART1_INTR_TX_EMPTY_POS)
#define UART1_INTR_TX_OVERFLOW           ((uint32) 0x01u << UART1_INTR_TX_OVERFLOW_POS)
#define UART1_INTR_TX_UNDERFLOW          ((uint32) 0x01u << UART1_INTR_TX_UNDERFLOW_POS)
#define UART1_INTR_TX_BLOCKED            ((uint32) 0x01u << UART1_INTR_TX_BLOCKED_POS)
#define UART1_INTR_TX_UART_NACK          ((uint32) 0x01u << UART1_INTR_TX_UART_NACK_POS)
#define UART1_INTR_TX_UART_DONE          ((uint32) 0x01u << UART1_INTR_TX_UART_DONE_POS)
#define UART1_INTR_TX_UART_ARB_LOST      ((uint32) 0x01u << UART1_INTR_TX_UART_ARB_LOST_POS)

