gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
/*
* UART1_INTR_RX, UART1_INTR_RX_SET,
* UART1_INTR_RX_MASK, UART1_INTR_RX_MASKED
*/
#define UART1_INTR_RX_TRIGGER_POS        (0u)   /* [0]  Trigger on RX FIFO entires            */
#define UART1_INTR_RX_NOT_EMPTY_POS      (2u)   /* [2]  RX FIFO is not empty                  */
#define UART1_INTR_RX_FULL_POS           (3u)   /* [3]  RX FIFO is full                       */
#define UART1_INTR_RX_OVERFLOW_POS       (5u)   /* [5]  Attempt to write to a full RX FIFO    */
#define UART1_INTR_RX_UNDERFLOW_POS      (6u)   /* [6]  Attempt to read from an empty RX FIFO */
#define UART1_INTR_RX_BLOCKED_POS        (7u)   /* [7]  No access to the EZ memory            */
#define UART1_INTR_RX_FRAME_ERROR_POS    (8u)   /* [8]  Frame error in received data frame    */
#define UART1_INTR_RX_PARITY_ERROR_POS   (9u)   /* [9]  Parity error in received data frame   */
#define UART1_INTR_RX_BAUD_DETECT_POS    (10u)  /* [10] LIN baud rate detection is completed   */
#define UART1_INTR_RX_BREAK_DETECT_POS   (11u)  /* [11] Break detection is successful         */
#define UART1_INTR_RX_TRIGGER            ((uint32) 0x01u)
#define UART1_INTR_RX_FIFO_LEVEL         (UART1_INTR_RX_TRIGGER)
#define UART1_INTR_RX_NOT_EMPTY          ((uint32) 0x01u << UART1_INTR_RX_NOT_EMPTY_POS)
#define UART1_INTR_RX_FULL               ((uint32) 0x01u << UART1_INTR_RX_FULL_POS)
#define UART1_INTR_RX_OVERFLOW           ((uint32) 0x01u << UART1_INTR_RX_OVERFLOW_POS)
#define UART1_INTR_RX_UNDERFLOW          ((uint32) 0x01u << UART1_INTR_RX_UNDERFLOW_POS)
#define UART1_INTR_RX_BLOCKED            ((uint32) 0x01u << UART1_INTR_RX_BLOCKED_POS)
#define UART1_INTR_RX_FRAME_ERROR        ((uint32) 0x01u << UART1_INTR_RX_FRAME_ERROR_POS)
#define UART1_INTR_RX_PARITY_ERROR       ((uint32) 0x01u << UART1_INTR_RX_PARITY_ERROR_POS)
#define UART1_INTR_RX_BAUD_DETECT        ((uint32) 0x01u << UART1_INTR_RX_BAUD_DETECT_POS)
#define UART1_INTR_RX_BREAK_DETECT       ((uint32) 0x01u << UART1_INTR_RX_BREAK_DETECT_POS)

/* Define all interrupt sources */
#define UART1_INTR_I2C_EC_ALL    (UART1_INTR_I2C_EC_WAKE_UP    | \
                                             UART1_INTR_I2C_EC_EZBUF_STOP | \
                                             UART1_INTR_I2C_EC_EZBUF_WRITE_STOP)

#define UART1_INTR_SPI_EC_ALL    (UART1_INTR_SPI_EC_WAKE_UP    | \
                                             UART1_INTR_SPI_EC_EZBUF_STOP | \
                                             UART1_INTR_SPI_EC_EZBUF_WRITE_STOP)

#define UART1_INTR_MASTER_ALL    (UART1_INTR_MASTER_I2C_ARB_LOST  | \
                                             UART1_INTR_MASTER_I2C_NACK      | \
                                             UART1_INTR_MASTER_I2C_ACK       | \
                                             UART1_INTR_MASTER_I2C_STOP      | \
                                             UART1_INTR_MASTER_I2C_BUS_ERROR | \
                                             UART1_INTR_MASTER_SPI_DONE)

#define UART1_INTR_SLAVE_ALL     (UART1_INTR_SLAVE_I2C_ARB_LOST      | \
                                             UART1_INTR_SLAVE_I2C_NACK          | \
                                             UART1_INTR_SLAVE_I2C_ACK           | \
                                             UART1_INTR_SLAVE_I2C_WRITE_STOP    | \
                                             UART1_INTR_SLAVE_I2C_STOP          | \
                                             UART1_INTR_SLAVE_I2C_START         | \
                                             UART1_INTR_SLAVE_I2C_ADDR_MATCH    | \
                                             UART1_INTR_SLAVE_I2C_GENERAL       | \
                                             UART1_INTR_SLAVE_I2C_BUS_ERROR     | \
                                             UART1_INTR_SLAVE_SPI_EZBUF_WRITE_STOP | \
                                             UART1_INTR_SLAVE_SPI_EZBUF_STOP       | \
                                             UART1_INTR_SLAVE_SPI_BUS_ERROR)

#define UART1_INTR_TX_ALL        (UART1_INTR_TX_TRIGGER   | \
                                             UART1_INTR_TX_NOT_FULL  | \
                                             UART1_INTR_TX_EMPTY     | \
                                             UART1_INTR_TX_OVERFLOW  | \
                                             UART1_INTR_TX_UNDERFLOW | \
                                             UART1_INTR_TX_BLOCKED   | \
                                             UART1_INTR_TX_UART_NACK | \
                                             UART1_INTR_TX_UART_DONE | \
                                             UART1_INTR_TX_UART_ARB_LOST)

#define UART1_INTR_RX_ALL        (UART1_INTR_RX_TRIGGER      | \
                                             UART1_INTR_RX_NOT_EMPTY    | \
                                             UART1_INTR_RX_FULL         | \
                                             UART1_INTR_RX_OVERFLOW     | \
                                             UART1_INTR_RX_UNDERFLOW    | \
                                             UART1_INTR_RX_BLOCKED      | \
                                             UART1_INTR_RX_FRAME_ERROR  | \
                                             UART1_INTR_RX_PARITY_ERROR | \
                                             UART1_INTR_RX_BAUD_DETECT  | \
                                             UART1_INTR_RX_BREAK_DETECT)

/* I2C and EZI2C slave address defines */
#define UART1_I2C_SLAVE_ADDR_POS    (0x01u)    /* 7-bit address shift */
#define UART1_I2C_SLAVE_ADDR_MASK   (0xFEu)    /* 8-bit address mask */

/* OVS constants for IrDA Low Power operation */
#define UART1_CTRL_OVS_IRDA_LP_OVS16     (0x00u)
#define UART1_CTRL_OVS_IRDA_LP_OVS32     (0x01u)
#define UART1_CTRL_OVS_IRDA_LP_OVS48     (0x02u)
#define UART1_CTRL_OVS_IRDA_LP_OVS96     (0x03u)
#define UART1_CTRL_OVS_IRDA_LP_OVS192    (0x04u)
#define UART1_CTRL_OVS_IRDA_LP_OVS768    (0x05u)
#define UART1_CTRL_OVS_IRDA_LP_OVS1536   (0x06u)

/* OVS constant for IrDA */
#define UART1_CTRL_OVS_IRDA_OVS16        (UART1_UART_IRDA_LP_OVS16)


