gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
/***************************************
*    Common Macro Definitions
***************************************/

/* Re-enables the SCB IP. A clear enable bit has a different effect
* on the scb IP depending on the version:
*  CY_SCBIP_V0: resets state, status, TX and RX FIFOs.
*  CY_SCBIP_V1 or later: resets state, status, TX and RX FIFOs and interrupt sources.
* Clear I2C command registers are because they are not impacted by re-enable.
*/
#define UART1_SCB_SW_RESET   UART1_I2CFwBlockReset()

/* TX FIFO macro */
#define UART1_CLEAR_TX_FIFO \
                            do{        \
                                UART1_TX_FIFO_CTRL_REG |= ((uint32)  UART1_TX_FIFO_CTRL_CLEAR); \
                                UART1_TX_FIFO_CTRL_REG &= ((uint32) ~UART1_TX_FIFO_CTRL_CLEAR); \
                            }while(0)

#define UART1_GET_TX_FIFO_ENTRIES    (UART1_TX_FIFO_STATUS_REG & \
                                                 UART1_TX_FIFO_STATUS_USED_MASK)

#define UART1_GET_TX_FIFO_SR_VALID   ((0u != (UART1_TX_FIFO_STATUS_REG & \
                                                         UART1_TX_FIFO_SR_VALID)) ? (1u) : (0u))

/* RX FIFO macro */
#define UART1_CLEAR_RX_FIFO \
                            do{        \
                                UART1_RX_FIFO_CTRL_REG |= ((uint32)  UART1_RX_FIFO_CTRL_CLEAR); \
                                UART1_RX_FIFO_CTRL_REG &= ((uint32) ~UART1_RX_FIFO_CTRL_CLEAR); \
                            }while(0)

#define UART1_GET_RX_FIFO_ENTRIES    (UART1_RX_FIFO_STATUS_REG & \
                                                    UART1_RX_FIFO_STATUS_USED_MASK)

#define UART1_GET_RX_FIFO_SR_VALID   ((0u != (UART1_RX_FIFO_STATUS_REG & \
                                                         UART1_RX_FIFO_SR_VALID)) ? (1u) : (0u))

/* Write interrupt source: set sourceMask bits in UART1_INTR_X_MASK_REG */
#define UART1_WRITE_INTR_I2C_EC_MASK(sourceMask) \
                                                do{         \
                                                    UART1_INTR_I2C_EC_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

#if (!UART1_CY_SCBIP_V1)
    #define UART1_WRITE_INTR_SPI_EC_MASK(sourceMask) \
                                                do{         \
                                                    UART1_INTR_SPI_EC_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)
#endif /* (!UART1_CY_SCBIP_V1) */

#define UART1_WRITE_INTR_MASTER_MASK(sourceMask) \
                                                do{         \
                                                    UART1_INTR_MASTER_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

#define UART1_WRITE_INTR_SLAVE_MASK(sourceMask)  \
                                                do{         \
                                                    UART1_INTR_SLAVE_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

#define UART1_WRITE_INTR_TX_MASK(sourceMask)     \
                                                do{         \
                                                    UART1_INTR_TX_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

#define UART1_WRITE_INTR_RX_MASK(sourceMask)     \
                                                do{         \
                                                    UART1_INTR_RX_MASK_REG = (uint32) (sourceMask); \
                                                }while(0)

/* Enable interrupt source: set sourceMask bits in UART1_INTR_X_MASK_REG */
#define UART1_ENABLE_INTR_I2C_EC(sourceMask) \
                                                do{     \
                                                    UART1_INTR_I2C_EC_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)
#if (!UART1_CY_SCBIP_V1)
    #define UART1_ENABLE_INTR_SPI_EC(sourceMask) \
                                                do{     \
                                                    UART1_INTR_SPI_EC_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)
#endif /* (!UART1_CY_SCBIP_V1) */

#define UART1_ENABLE_INTR_MASTER(sourceMask) \
                                                do{     \
                                                    UART1_INTR_MASTER_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)

#define UART1_ENABLE_INTR_SLAVE(sourceMask)  \
                                                do{     \
                                                    UART1_INTR_SLAVE_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)

#define UART1_ENABLE_INTR_TX(sourceMask)     \
                                                do{     \
                                                    UART1_INTR_TX_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)

#define UART1_ENABLE_INTR_RX(sourceMask)     \
                                                do{     \
                                                    UART1_INTR_RX_MASK_REG |= (uint32) (sourceMask); \
                                                }while(0)

/* Disable interrupt source: clear sourceMask bits in UART1_INTR_X_MASK_REG */
#define UART1_DISABLE_INTR_I2C_EC(sourceMask) \
                                do{                      \
                                    UART1_INTR_I2C_EC_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                }while(0)

#if (!UART1_CY_SCBIP_V1)
    #define UART1_DISABLE_INTR_SPI_EC(sourceMask) \
                                do{                      \
                                    UART1_INTR_SPI_EC_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                 }while(0)
#endif /* (!UART1_CY_SCBIP_V1) */

#define UART1_DISABLE_INTR_MASTER(sourceMask) \
                                do{                      \
                                UART1_INTR_MASTER_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                }while(0)

#define UART1_DISABLE_INTR_SLAVE(sourceMask) \
                                do{                     \
                                    UART1_INTR_SLAVE_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                }while(0)

#define UART1_DISABLE_INTR_TX(sourceMask)    \
                                do{                     \
                                    UART1_INTR_TX_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                 }while(0)

#define UART1_DISABLE_INTR_RX(sourceMask)    \
                                do{                     \
                                    UART1_INTR_RX_MASK_REG &= ((uint32) ~((uint32) (sourceMask))); \
                                }while(0)

/* Set interrupt sources: write sourceMask bits in UART1_INTR_X_SET_REG */
#define UART1_SET_INTR_MASTER(sourceMask)    \
                                                do{     \
                                                    UART1_INTR_MASTER_SET_REG = (uint32) (sourceMask); \
                                                }while(0)

#define UART1_SET_INTR_SLAVE(sourceMask) \
                                                do{ \
                                                    UART1_INTR_SLAVE_SET_REG = (uint32) (sourceMask); \
                                                }while(0)

#define UART1_SET_INTR_TX(sourceMask)    \
                                                do{ \
                                                    UART1_INTR_TX_SET_REG = (uint32) (sourceMask); \
                                                }while(0)

#define UART1_SET_INTR_RX(sourceMask)    \
                                                do{ \
                                                    UART1_INTR_RX_SET_REG = (uint32) (sourceMask); \
                                                }while(0)

/* Clear interrupt sources: write sourceMask bits in UART1_INTR_X_REG */
#define UART1_CLEAR_INTR_I2C_EC(sourceMask)  \
                                                do{     \
                                                    UART1_INTR_I2C_EC_REG = (uint32) (sourceMask); \
                                                }while(0)

#if (!UART1_CY_SCBIP_V1)
    #define UART1_CLEAR_INTR_SPI_EC(sourceMask)  \
                                                do{     \
                                                    UART1_INTR_SPI_EC_REG = (uint32) (sourceMask); \
                                                }while(0)
#endif /* (!UART1_CY_SCBIP_V1) */

#define UART1_CLEAR_INTR_MASTER(sourceMask)  \
                                                do{     \
                                                    UART1_INTR_MASTER_REG = (uint32) (sourceMask); \
                                                }while(0)

#define UART1_CLEAR_INTR_SLAVE(sourceMask)   \
                                                do{     \
                                                    UART1_INTR_SLAVE_REG  = (uint32) (sourceMask); \
                                                }while(0)

