gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
#define UART1_CLEAR_INTR_TX(sourceMask)      \
                                                do{     \
                                                    UART1_INTR_TX_REG     = (uint32) (sourceMask); \
                                                }while(0)

#define UART1_CLEAR_INTR_RX(sourceMask)      \
                                                do{     \
                                                    UART1_INTR_RX_REG     = (uint32) (sourceMask); \
                                                }while(0)

/* Return true if sourceMask is set in UART1_INTR_CAUSE_REG */
#define UART1_CHECK_CAUSE_INTR(sourceMask)    (0u != (UART1_INTR_CAUSE_REG & (sourceMask)))

/* Return true if sourceMask is set in INTR_X_MASKED_REG */
#define UART1_CHECK_INTR_I2C_EC(sourceMask)  (0u != (UART1_INTR_I2C_EC_REG & (sourceMask)))
#if (!UART1_CY_SCBIP_V1)
    #define UART1_CHECK_INTR_SPI_EC(sourceMask)  (0u != (UART1_INTR_SPI_EC_REG & (sourceMask)))
#endif /* (!UART1_CY_SCBIP_V1) */
#define UART1_CHECK_INTR_MASTER(sourceMask)  (0u != (UART1_INTR_MASTER_REG & (sourceMask)))
#define UART1_CHECK_INTR_SLAVE(sourceMask)   (0u != (UART1_INTR_SLAVE_REG  & (sourceMask)))
#define UART1_CHECK_INTR_TX(sourceMask)      (0u != (UART1_INTR_TX_REG     & (sourceMask)))
#define UART1_CHECK_INTR_RX(sourceMask)      (0u != (UART1_INTR_RX_REG     & (sourceMask)))

/* Return true if sourceMask is set in UART1_INTR_X_MASKED_REG */
#define UART1_CHECK_INTR_I2C_EC_MASKED(sourceMask)   (0u != (UART1_INTR_I2C_EC_MASKED_REG & \
                                                                       (sourceMask)))
#if (!UART1_CY_SCBIP_V1)
    #define UART1_CHECK_INTR_SPI_EC_MASKED(sourceMask)   (0u != (UART1_INTR_SPI_EC_MASKED_REG & \
                                                                       (sourceMask)))
#endif /* (!UART1_CY_SCBIP_V1) */
#define UART1_CHECK_INTR_MASTER_MASKED(sourceMask)   (0u != (UART1_INTR_MASTER_MASKED_REG & \
                                                                       (sourceMask)))
#define UART1_CHECK_INTR_SLAVE_MASKED(sourceMask)    (0u != (UART1_INTR_SLAVE_MASKED_REG  & \
                                                                       (sourceMask)))
#define UART1_CHECK_INTR_TX_MASKED(sourceMask)       (0u != (UART1_INTR_TX_MASKED_REG     & \
                                                                       (sourceMask)))
#define UART1_CHECK_INTR_RX_MASKED(sourceMask)       (0u != (UART1_INTR_RX_MASKED_REG     & \
                                                                       (sourceMask)))

/* Return true if sourceMask is set in UART1_CTRL_REG: generally is used to check enable bit */
#define UART1_GET_CTRL_ENABLED    (0u != (UART1_CTRL_REG & UART1_CTRL_ENABLED))

#define UART1_CHECK_SLAVE_AUTO_ADDR_NACK     (0u != (UART1_I2C_CTRL_REG & \
                                                                UART1_I2C_CTRL_S_NOT_READY_DATA_NACK))


/***************************************
*      I2C Macro Definitions
***************************************/

/* Enable auto ACK/NACK */
#define UART1_ENABLE_SLAVE_AUTO_ADDR_NACK \
                            do{                      \
                                UART1_I2C_CTRL_REG |= UART1_I2C_CTRL_S_NOT_READY_DATA_NACK; \
                            }while(0)

#define UART1_ENABLE_SLAVE_AUTO_DATA_ACK \
                            do{                     \
                                UART1_I2C_CTRL_REG |= UART1_I2C_CTRL_S_READY_DATA_ACK; \
                            }while(0)

#define UART1_ENABLE_SLAVE_AUTO_DATA_NACK \
                            do{                      \
                                UART1_I2C_CTRL_REG |= UART1_I2C_CTRL_S_NOT_READY_DATA_NACK; \
                            }while(0)

#define UART1_ENABLE_MASTER_AUTO_DATA_ACK \
                            do{                      \
                                UART1_I2C_CTRL_REG |= UART1_I2C_CTRL_M_READY_DATA_ACK; \
                            }while(0)

#define UART1_ENABLE_MASTER_AUTO_DATA_NACK \
                            do{                       \
                                UART1_I2C_CTRL_REG |= UART1_I2C_CTRL_M_NOT_READY_DATA_NACK; \
                            }while(0)

/* Disable auto ACK/NACK */
#define UART1_DISABLE_SLAVE_AUTO_ADDR_NACK \
                            do{                       \
                                UART1_I2C_CTRL_REG &= ~UART1_I2C_CTRL_S_NOT_READY_DATA_NACK; \
                            }while(0)

#define UART1_DISABLE_SLAVE_AUTO_DATA_ACK \
                            do{                      \
                                UART1_I2C_CTRL_REG &= ~UART1_I2C_CTRL_S_READY_DATA_ACK; \
                            }while(0)

#define UART1_DISABLE_SLAVE_AUTO_DATA_NACK \
                            do{                       \
                                UART1_I2C_CTRL_REG &= ~UART1_I2C_CTRL_S_NOT_READY_DATA_NACK; \
                            }while(0)

#define UART1_DISABLE_MASTER_AUTO_DATA_ACK \
                            do{                       \
                                UART1_I2C_CTRL_REG &= ~UART1_I2C_CTRL_M_READY_DATA_ACK; \
                            }while(0)

#define UART1_DISABLE_MASTER_AUTO_DATA_NACK \
                            do{                        \
                                UART1_I2C_CTRL_REG &= ~UART1_I2C_CTRL_M_NOT_READY_DATA_NACK; \
                            }while(0)

/* Enable Slave autoACK/NACK Data */
#define UART1_ENABLE_SLAVE_AUTO_DATA \
                            do{                 \
                                UART1_I2C_CTRL_REG |= (UART1_I2C_CTRL_S_READY_DATA_ACK |      \
                                                                  UART1_I2C_CTRL_S_NOT_READY_DATA_NACK); \
                            }while(0)

/* Disable Slave autoACK/NACK Data */
#define UART1_DISABLE_SLAVE_AUTO_DATA \
                            do{                  \
                                UART1_I2C_CTRL_REG &= ((uint32) \
                                                                  ~(UART1_I2C_CTRL_S_READY_DATA_ACK |       \
                                                                    UART1_I2C_CTRL_S_NOT_READY_DATA_NACK)); \
                            }while(0)

/* Disable Master autoACK/NACK Data */
#define UART1_DISABLE_MASTER_AUTO_DATA \
                            do{                   \
                                UART1_I2C_CTRL_REG &= ((uint32) \
                                                                  ~(UART1_I2C_CTRL_M_READY_DATA_ACK |       \
                                                                    UART1_I2C_CTRL_M_NOT_READY_DATA_NACK)); \
                            }while(0)
/* Disables auto data ACK/NACK bits */
#define UART1_DISABLE_AUTO_DATA \
                do{                        \
                    UART1_I2C_CTRL_REG &= ((uint32) ~(UART1_I2C_CTRL_M_READY_DATA_ACK      |  \
                                                                 UART1_I2C_CTRL_M_NOT_READY_DATA_NACK |  \
                                                                 UART1_I2C_CTRL_S_READY_DATA_ACK      |  \
                                                                 UART1_I2C_CTRL_S_NOT_READY_DATA_NACK)); \
                }while(0)

/* Master commands */
#define UART1_I2C_MASTER_GENERATE_START \
                            do{                    \
                                UART1_I2C_MASTER_CMD_REG = UART1_I2C_MASTER_CMD_M_START_ON_IDLE; \
                            }while(0)

