gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
#define UART1_I2C_MASTER_CLEAR_START \
                            do{                 \
                                UART1_I2C_MASTER_CMD_REG =  ((uint32) 0u); \
                            }while(0)

#define UART1_I2C_MASTER_GENERATE_RESTART UART1_I2CReStartGeneration()

#define UART1_I2C_MASTER_GENERATE_STOP \
                            do{                   \
                                UART1_I2C_MASTER_CMD_REG =                                            \
                                    (UART1_I2C_MASTER_CMD_M_STOP |                                    \
                                        (UART1_CHECK_I2C_STATUS(UART1_I2C_STATUS_M_READ) ? \
                                            (UART1_I2C_MASTER_CMD_M_NACK) : (0u)));                   \
                            }while(0)

#define UART1_I2C_MASTER_GENERATE_ACK \
                            do{                  \
                                UART1_I2C_MASTER_CMD_REG = UART1_I2C_MASTER_CMD_M_ACK; \
                            }while(0)

#define UART1_I2C_MASTER_GENERATE_NACK \
                            do{                   \
                                UART1_I2C_MASTER_CMD_REG = UART1_I2C_MASTER_CMD_M_NACK; \
                            }while(0)

/* Slave commands */
#define UART1_I2C_SLAVE_GENERATE_ACK \
                            do{                 \
                                UART1_I2C_SLAVE_CMD_REG = UART1_I2C_SLAVE_CMD_S_ACK; \
                            }while(0)

#if (UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
    /* Slave NACK generation for EC_AM logic on address phase. Ticket ID #183902 */
    void UART1_I2CSlaveNackGeneration(void);
    #define UART1_I2C_SLAVE_GENERATE_NACK UART1_I2CSlaveNackGeneration()

#else
    #define UART1_I2C_SLAVE_GENERATE_NACK \
                            do{                      \
                                UART1_I2C_SLAVE_CMD_REG = UART1_I2C_SLAVE_CMD_S_NACK; \
                            }while(0)
#endif /* (UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */

#define UART1_I2C_SLAVE_CLEAR_NACK \
                            do{               \
                                UART1_I2C_SLAVE_CMD_REG = 0u; \
                            }while(0)

/* Return 8-bit address. The input address should be 7-bits */
#define UART1_GET_I2C_8BIT_ADDRESS(addr) (((uint32) ((uint32) (addr) << \
                                                                    UART1_I2C_SLAVE_ADDR_POS)) & \
                                                                        UART1_I2C_SLAVE_ADDR_MASK)

#define UART1_GET_I2C_7BIT_ADDRESS(addr) ((uint32) (addr) >> UART1_I2C_SLAVE_ADDR_POS)

/* Adjust SDA filter Trim settings */
#define UART1_DEFAULT_I2C_CFG_SDA_FILT_TRIM  (0x02u)
#define UART1_EC_AM_I2C_CFG_SDA_FILT_TRIM    (0x03u)

#if (UART1_CY_SCBIP_V0)
    #define UART1_SET_I2C_CFG_SDA_FILT_TRIM(sdaTrim) \
        do{                                                 \
            UART1_I2C_CFG_REG =                  \
                            ((UART1_I2C_CFG_REG & (uint32) ~UART1_I2C_CFG_SDA_FILT_TRIM_MASK) | \
                             ((uint32) ((uint32) (sdaTrim) <<UART1_I2C_CFG_SDA_FILT_TRIM_POS)));           \
        }while(0)
#endif /* (UART1_CY_SCBIP_V0) */

/* Enable/Disable analog and digital filter */
#define UART1_DIGITAL_FILTER_DISABLE    (0u)
#define UART1_DIGITAL_FILTER_ENABLE     (1u)
#define UART1_I2C_DATA_RATE_FS_MODE_MAX (400u)
#if (UART1_CY_SCBIP_V0)
    /* UART1_I2C_CFG_SDA_FILT_OUT_ENABLED is disabled by default */
    #define UART1_I2C_CFG_FILT_MASK  (UART1_I2C_CFG_SDA_FILT_ENABLED | \
                                                 UART1_I2C_CFG_SCL_FILT_ENABLED)
#else
    /* UART1_I2C_CFG_SDA_OUT_FILT_SEL_MASK is disabled by default */
    #define UART1_I2C_CFG_FILT_MASK  (UART1_I2C_CFG_SDA_IN_FILT_SEL | \
                                                 UART1_I2C_CFG_SCL_IN_FILT_SEL)
#endif /* (UART1_CY_SCBIP_V0) */

#define UART1_I2C_CFG_ANALOG_FITER_DISABLE \
        do{                                           \
            UART1_I2C_CFG_REG &= (uint32) ~UART1_I2C_CFG_FILT_MASK; \
        }while(0)

#define UART1_I2C_CFG_ANALOG_FITER_ENABLE \
        do{                                          \
            UART1_I2C_CFG_REG |= (uint32)  UART1_I2C_CFG_FILT_MASK; \
        }while(0)

/* Return slave select number from SPI_CTRL register */
#define UART1_GET_SPI_CTRL_SS(activeSelect) (((uint32) ((uint32) (activeSelect) << \
                                                                    UART1_SPI_CTRL_SLAVE_SELECT_POS)) & \
                                                                        UART1_SPI_CTRL_SLAVE_SELECT_MASK)

/* Return true if bit is set in UART1_I2C_STATUS_REG */
#define UART1_CHECK_I2C_STATUS(sourceMask)   (0u != (UART1_I2C_STATUS_REG & (sourceMask)))

/* Return true if bit is set in UART1_SPI_STATUS_REG */
#define UART1_CHECK_SPI_STATUS(sourceMask)   (0u != (UART1_SPI_STATUS_REG & (sourceMask)))

/* Return FIFO size depends on UART1_CTRL_BYTE_MODE bit */
#define UART1_GET_FIFO_SIZE(condition) ((0u != (condition)) ? \
                                                    (2u * UART1_FIFO_SIZE) : (UART1_FIFO_SIZE))


/***************************************
*       Get Macros Definitions
***************************************/

/* UART1_CTRL */
#define UART1_GET_CTRL_OVS(oversample)       (((uint32) (oversample) - 1u) & UART1_CTRL_OVS_MASK)

#define UART1_GET_CTRL_EC_OP_MODE(opMode)        ((0u != (opMode)) ? \
                                                                (UART1_CTRL_EC_OP_MODE)  : (0u))

#define UART1_GET_CTRL_EC_AM_MODE(amMode)        ((0u != (amMode)) ? \
                                                                (UART1_CTRL_EC_AM_MODE)  : (0u))

#define UART1_GET_CTRL_BLOCK(block)              ((0u != (block))  ? \
                                                                (UART1_CTRL_BLOCK)       : (0u))

#define UART1_GET_CTRL_ADDR_ACCEPT(acceptAddr)   ((0u != (acceptAddr)) ? \
                                                                (UART1_CTRL_ADDR_ACCEPT) : (0u))

#if (UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
    #define UART1_GET_CTRL_BYTE_MODE(mode)   (0u)
#else
    #define UART1_GET_CTRL_BYTE_MODE(mode)   ((0u != (mode)) ? \
                                                            (UART1_CTRL_BYTE_MODE) : (0u))
#endif /* (UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */

/* UART1_I2C_CTRL */
#define UART1_GET_I2C_CTRL_HIGH_PHASE_OVS(oversampleHigh) (((uint32) (oversampleHigh) - 1u) & \
                                                                        UART1_I2C_CTRL_HIGH_PHASE_OVS_MASK)

#define UART1_GET_I2C_CTRL_LOW_PHASE_OVS(oversampleLow)  ((((uint32) (oversampleLow) - 1u) << \
                                                                    UART1_I2C_CTRL_LOW_PHASE_OVS_POS) &  \
                                                                    UART1_I2C_CTRL_LOW_PHASE_OVS_MASK)

