gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
#define UART1_GET_I2C_CTRL_S_NOT_READY_ADDR_NACK(wakeNack) ((0u != (wakeNack)) ? \
                                                            (UART1_I2C_CTRL_S_NOT_READY_ADDR_NACK) : (0u))

#define UART1_GET_I2C_CTRL_S_GENERAL_IGNORE(genCall) ((0u != (genCall)) ? \
                                                                    (UART1_I2C_CTRL_S_GENERAL_IGNORE) : (0u))

#define UART1_GET_I2C_CTRL_SL_MSTR_MODE(mode)    ((uint32)(mode) << UART1_I2C_CTRL_SLAVE_MODE_POS)

/* UART1_SPI_CTRL */
#define UART1_GET_SPI_CTRL_CONTINUOUS(separate)  ((0u != (separate)) ? \
                                                                (UART1_SPI_CTRL_CONTINUOUS) : (0u))

#define UART1_GET_SPI_CTRL_SELECT_PRECEDE(mode)  ((0u != (mode)) ? \
                                                                      (UART1_SPI_CTRL_SELECT_PRECEDE) : (0u))

#define UART1_GET_SPI_CTRL_SCLK_MODE(mode)       (((uint32) (mode) << \
                                                                        UART1_SPI_CTRL_CPHA_POS) & \
                                                                        UART1_SPI_CTRL_SCLK_MODE_MASK)

#define UART1_GET_SPI_CTRL_LATE_MISO_SAMPLE(lateMiso) ((0u != (lateMiso)) ? \
                                                                    (UART1_SPI_CTRL_LATE_MISO_SAMPLE) : (0u))

#if (UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
    #define UART1_GET_SPI_CTRL_SCLK_CONTINUOUS(sclkType) (0u)
    #define UART1_GET_SPI_CTRL_SSEL_POLARITY(polarity)   (0u)
#else
    #define UART1_GET_SPI_CTRL_SCLK_CONTINUOUS(sclkType) ((0u != (sclkType)) ? \
                                                                    (UART1_SPI_CTRL_SCLK_CONTINUOUS) : (0u))

    #define UART1_GET_SPI_CTRL_SSEL_POLARITY(polarity)   (((uint32) (polarity) << \
                                                                     UART1_SPI_CTRL_SSEL0_POLARITY_POS) & \
                                                                     UART1_SPI_CTRL_SSEL_POLARITY_MASK)
#endif /* ((UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */

#define UART1_GET_SPI_CTRL_SUB_MODE(mode)        (((uint32) (mode) << UART1_SPI_CTRL_MODE_POS) & \
                                                                                 UART1_SPI_CTRL_MODE_MASK)

#define UART1_GET_SPI_CTRL_SLAVE_SELECT(select)  (((uint32) (select) << \
                                                                      UART1_SPI_CTRL_SLAVE_SELECT_POS) & \
                                                                      UART1_SPI_CTRL_SLAVE_SELECT_MASK)

#define UART1_GET_SPI_CTRL_MASTER_MODE(mode)     ((0u != (mode)) ? \
                                                                (UART1_SPI_CTRL_MASTER) : (0u))

/* UART1_UART_CTRL */
#define UART1_GET_UART_CTRL_MODE(mode)           (((uint32) (mode) << \
                                                                            UART1_UART_CTRL_MODE_POS) & \
                                                                            UART1_UART_CTRL_MODE_MASK)

/* UART1_UART_RX_CTRL */
#define UART1_GET_UART_RX_CTRL_MODE(stopBits)    (((uint32) (stopBits) - 1u) & \
                                                                        UART1_UART_RX_CTRL_STOP_BITS_MASK)

#define UART1_GET_UART_RX_CTRL_PARITY(parity)    ((0u != (parity)) ? \
                                                                    (UART1_UART_RX_CTRL_PARITY) : (0u))

#define UART1_GET_UART_RX_CTRL_POLARITY(polarity)    ((0u != (polarity)) ? \
                                                                    (UART1_UART_RX_CTRL_POLARITY) : (0u))

#define UART1_GET_UART_RX_CTRL_DROP_ON_PARITY_ERR(dropErr) ((0u != (dropErr)) ? \
                                                        (UART1_UART_RX_CTRL_DROP_ON_PARITY_ERR) : (0u))

#define UART1_GET_UART_RX_CTRL_DROP_ON_FRAME_ERR(dropErr) ((0u != (dropErr)) ? \
                                                        (UART1_UART_RX_CTRL_DROP_ON_FRAME_ERR) : (0u))

#define UART1_GET_UART_RX_CTRL_MP_MODE(mpMode)   ((0u != (mpMode)) ? \
                                                        (UART1_UART_RX_CTRL_MP_MODE) : (0u))

#define UART1_GET_UART_RX_CTRL_BREAK_WIDTH(width)    (((uint32) ((uint32) (width) - 1u) << \
                                                                    UART1_UART_RX_CTRL_BREAK_WIDTH_POS) & \
                                                                    UART1_UART_RX_CTRL_BREAK_WIDTH_MASK)

/* UART1_UART_TX_CTRL */
#define UART1_GET_UART_TX_CTRL_MODE(stopBits)    (((uint32) (stopBits) - 1u) & \
                                                                UART1_UART_RX_CTRL_STOP_BITS_MASK)

#define UART1_GET_UART_TX_CTRL_PARITY(parity)    ((0u != (parity)) ? \
                                                               (UART1_UART_TX_CTRL_PARITY) : (0u))

#define UART1_GET_UART_TX_CTRL_RETRY_NACK(nack)  ((0u != (nack)) ? \
                                                               (UART1_UART_TX_CTRL_RETRY_ON_NACK) : (0u))

/* UART1_UART_FLOW_CTRL */
#if !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
    #define UART1_GET_UART_FLOW_CTRL_TRIGGER_LEVEL(level)   ( (uint32) (level) & \
                                                                 UART1_UART_FLOW_CTRL_TRIGGER_LEVEL_MASK)

    #define UART1_GET_UART_FLOW_CTRL_RTS_POLARITY(polarity) ((0u != (polarity)) ? \
                                                                (UART1_UART_FLOW_CTRL_RTS_POLARITY) : (0u))

    #define UART1_GET_UART_FLOW_CTRL_CTS_POLARITY(polarity) ((0u != (polarity)) ? \
                                                                (UART1_UART_FLOW_CTRL_CTS_POLARITY) : (0u))

    #define UART1_GET_UART_FLOW_CTRL_CTS_ENABLE(ctsEn)      ((0u != (ctsEn)) ? \
                                                                (UART1_UART_FLOW_CTRL_CTS_ENABLE) : (0u))
#endif /* !(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */

/* UART1_RX_CTRL */
#define UART1_GET_RX_CTRL_DATA_WIDTH(dataWidth)  (((uint32) (dataWidth) - 1u) & \
                                                                UART1_RX_CTRL_DATA_WIDTH_MASK)

#define UART1_GET_RX_CTRL_BIT_ORDER(bitOrder)    ((0u != (bitOrder)) ? \
                                                                (UART1_RX_CTRL_MSB_FIRST) : (0u))

