gitmac56/Git_IR_REMO/PSoC/Prototype01.cydsn/Generated_Source/PSoC4/UART1.h
#define UART1_GET_RX_CTRL_MEDIAN(filterEn)       ((0u != (filterEn)) ? \
                                                                (UART1_RX_CTRL_MEDIAN) : (0u))

/* UART1_RX_MATCH */
#define UART1_GET_RX_MATCH_ADDR(addr)    ((uint32) (addr) & UART1_RX_MATCH_ADDR_MASK)
#define UART1_GET_RX_MATCH_MASK(mask)    (((uint32) (mask) << \
                                                            UART1_RX_MATCH_MASK_POS) & \
                                                            UART1_RX_MATCH_MASK_MASK)

/* UART1_RX_FIFO_CTRL */
#define UART1_GET_RX_FIFO_CTRL_TRIGGER_LEVEL(level)  ((uint32) (level) & \
                                                                    UART1_RX_FIFO_CTRL_TRIGGER_LEVEL_MASK)

/* UART1_TX_CTRL */
#define UART1_GET_TX_CTRL_DATA_WIDTH(dataWidth)  (((uint32) (dataWidth) - 1u) & \
                                                                UART1_TX_CTRL_DATA_WIDTH_MASK)

#define UART1_GET_TX_CTRL_BIT_ORDER(bitOrder)    ((0u != (bitOrder)) ? \
                                                                (UART1_TX_CTRL_MSB_FIRST) : (0u))

/* UART1_TX_FIFO_CTRL */
#define UART1_GET_TX_FIFO_CTRL_TRIGGER_LEVEL(level)  ((uint32) (level) & \
                                                                    UART1_TX_FIFO_CTRL_TRIGGER_LEVEL_MASK)

/* UART1_INTR_SLAVE_I2C_GENERAL */
#define UART1_GET_INTR_SLAVE_I2C_GENERAL(genCall)  ((0u != (genCall)) ? \
                                                                (UART1_INTR_SLAVE_I2C_GENERAL) : (0u))

/* Return true if master mode is enabled UART1_SPI_CTRL_REG */
#define UART1_CHECK_SPI_MASTER   (0u != (UART1_SPI_CTRL_REG & UART1_SPI_CTRL_MASTER))

/* Return inactive state of SPI SCLK line depends on CPOL */
#define UART1_GET_SPI_SCLK_INACTIVE \
            ((0u == (UART1_SPI_CTRL_REG & UART1_SPI_CTRL_CPOL)) ? (0u) : (1u))

/* Get output pin inactive state */
#if (UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1)
#define UART1_GET_SPI_SS0_INACTIVE       (1u)
#define UART1_GET_SPI_SS1_INACTIVE       (1u)
#define UART1_GET_SPI_SS2_INACTIVE       (1u)
#define UART1_GET_SPI_SS3_INACTIVE       (1u)
#define UART1_GET_UART_RTS_INACTIVE      (1u)

#else
#define UART1_GET_SPI_SS0_INACTIVE  \
        ((0u != (UART1_SPI_CTRL_REG & UART1_SPI_CTRL_SSEL0_POLARITY)) ? (0u) : (1u))

#define UART1_GET_SPI_SS1_INACTIVE  \
        ((0u != (UART1_SPI_CTRL_REG & UART1_SPI_CTRL_SSEL1_POLARITY)) ? (0u) : (1u))

#define UART1_GET_SPI_SS2_INACTIVE  \
        ((0u != (UART1_SPI_CTRL_REG & UART1_SPI_CTRL_SSEL2_POLARITY)) ? (0u) : (1u))

#define UART1_GET_SPI_SS3_INACTIVE  \
        ((0u != (UART1_SPI_CTRL_REG & UART1_SPI_CTRL_SSEL3_POLARITY)) ? (0u) : (1u))

#define UART1_GET_UART_RTS_INACTIVE \
        ((0u == (UART1_UART_FLOW_CTRL_REG & UART1_UART_FLOW_CTRL_RTS_POLARITY)) ? (0u) : (1u))

#endif /*(UART1_CY_SCBIP_V0 || UART1_CY_SCBIP_V1) */

/* Clear register constants for configuration and interrupt mask */
#define UART1_CLEAR_REG          ((uint32) (0u))
#define UART1_NO_INTR_SOURCES    ((uint32) (0u))
#define UART1_DUMMY_PARAM        ((uint32) (0u))
#define UART1_SUBMODE_SPI_SLAVE  ((uint32) (0u))

/* Return in case of I2C read error */
#define UART1_I2C_INVALID_BYTE   ((uint32) 0xFFFFFFFFu)
#define UART1_CHECK_VALID_BYTE   ((uint32) 0x80000000u)


/***************************************
* The following code is DEPRECATED and
* must not be used.
***************************************/

#define UART1_CHECK_INTR_EC_I2C(sourceMask)  UART1_CHECK_INTR_I2C_EC(sourceMask)
#if (!UART1_CY_SCBIP_V1)
    #define UART1_CHECK_INTR_EC_SPI(sourceMask)  UART1_CHECK_INTR_SPI_EC(sourceMask)
#endif /* (!UART1_CY_SCBIP_V1) */

#define UART1_CY_SCBIP_V1_I2C_ONLY   (UART1_CY_SCBIP_V1)
#define UART1_EZBUFFER_SIZE          (UART1_EZ_DATA_NR)

#define UART1_EZBUF_DATA00_REG   UART1_EZBUF_DATA0_REG
#define UART1_EZBUF_DATA00_PTR   UART1_EZBUF_DATA0_PTR

#endif /* (CY_SCB_UART1_H) */


/* [] END OF FILE */
